
"use strict";


/***********************************************************
 *    定数
 ***********************************************************/

var code_version = 3;
var event_id = 203;

var ship_data = [
  [ "正規空母/装甲空母", "oooxxxxxoxxx", [
    [ 404, "赤城改二", [21, 21, 32, 12, 4] ],
    [ 409, "赤城改二戊", [16, 16, 40, 4, 2] ],
    [ 405, "加賀改二", [20, 20, 44, 12, 3] ],
    [ 410, "加賀改二戊", [18, 18, 40, 8, 2] ],
    [ 446, "加賀改二護", [16, 16, 18, 8, 6], "oooxxxxooxxx" ],
    [ 197, "蒼龍改二", [18, 35, 20, 6] ],
    [ 196, "飛龍改二", [18, 36, 22, 3] ],
    [ 261, "翔鶴改二", [27, 27, 27, 12] ],
    [ 266, "翔鶴改二甲", [34, 21, 12, 9], "oooxxxxooxxx" ],
    [ 262, "瑞鶴改二", [28, 26, 26, 13] ],
    [ 267, "瑞鶴改二甲", [34, 24, 12, 6], "oooxxxxooxxx" ],
    [ [206, 229, 230], "雲龍改/天城改/葛城改", [18, 21, 27, 3] ],
    [ 156, "大鳳改", [30, 24, 24, 8] ],
    [ 1433, "Graf Zeppelin改", [30, 13, 10, 3] ],
    [ 1445, "Aquila改", [15, 26, 15, 10] ],
    [ 345, "Saratoga Mk.II", [32, 24, 18, 6] ],
    [ 350, "Saratoga Mk.II Mod.2", [37, 24, 19, 13] ],
    [ 1477, "Intrepid改", [40, 36, 21, 15] ],
    [ 1704, "Hornet改", [36, 19, 19, 16] ],
    [ 1473, "Ark Royal改", [24, 30, 12, 12] ],
  ]],
  [ "軽空母", "oooxxxxxoxxx", [
    [ 1385, "鳳翔改", [14, 16, 12] ],
    [ 157, "龍驤改二", [18, 28, 6, 3] ],
    [ 190, "龍鳳改", [21, 9, 9, 6] ],
    [ 1382, "祥鳳改", [18, 12, 12, 6] ],
    [ 355, "瑞鳳改二", [21, 18, 12, 6] ],
    [ 360, "瑞鳳改二乙", [18, 15, 15, 2] ],
    [ 1383, "飛鷹改", [18, 18, 18, 12] ],
    [ 208, "隼鷹改二", [24, 18, 20, 4] ],
    [ [121, 122], "千歳航改二/千代田航改二", [24, 16, 11, 8] ],
    [ 331, "大鷹改二", [14, 14, 8, 3] ],
    [ 336, "神鷹改二", [9, 18, 18, 6] ],
    [ [308, 309], "鈴谷航改二/熊野航改二", [15, 12, 12, 8] ],
    [ 1476, "Gambier Bay改", [16, 12, 6] ],
  ]],
  [ "航空戦艦", "xxxooxxxxoxx", [
    [ [211, 212], "扶桑改二/山城改二", [4, 4, 9, 23] ],
    [ 353, "伊勢改二", [2, 2, 22, 22, 9], "oxoooxxxooxx" ],
    [ 354, "日向改二", [2, 8, 24, 12, 11], "oxoooxxxooxx" ],
  ]],
  [ "航空巡洋艦", "xxxooxxxxoxx", [
    [ 101, "最上改", [5, 6, 5, 11] ],
    [ 117, "三隈改", [5, 6, 5, 8] ],
    [ [303, 304], "鈴谷改二/熊野改二", [3, 3, 7, 11] ],
    [ [188, 189], "利根改二/筑摩改二", [2, 2, 9, 5] ],
  ]],
  [ "戦艦", "xxxoxxxxxoxx", [
    [ 391, "金剛改二丙", [2, 2, 3, 6], "xxxxoxxxxoxx" ],
    [ 392, "比叡改二丙", [2, 2, 2, 2] ],
    [ 341, "長門改二", [3, 3, 6, 3] ],
    [ 373, "陸奥改二", [2, 3, 3, 7] ],
    [ 136, "大和改", [7, 7, 7, 7] ],
    [ 346, "武蔵改二", [5, 5, 5, 8, 5] ],
  ]],
  [ "戦艦 (伊艦)", "xxxooxxxxoxx", [
    [ [246, 247], "Italia/Roma改", [3, 3, 3, 3] ],
  ]],
  [ "重巡洋艦 (伊艦)", "xxxooxxxxoxx", [
    [ 296, "Zara due", [6, 3, 3, 3] ],
    [ 1441, "Pola改", [2, 2, 2, 2] ],
  ]],
  [ "軽巡洋艦", "xxxxoxxxxoxx", [
    [ 347, "多摩改二", [1, 1, 1], "xxxooxxxxoxx" ],
    [ 288, "由良改二", [1, 2, 1], "xxxooxxxxoxx" ],
    [ [1401, 1402, 1403, 1410], "[阿賀野/能代/矢矧/酒匂]改", [2, 2, 2] ],
    [ 430, "Gotland andra", [2, 2, 3, 7] ],
  ]],
  [ "水上機母艦", "xxxooxxxxoxx", [
    [ 299, "神威改", [11, 8, 3] ],
    [ [99, 100], "千歳甲/千代田甲", [12, 6, 6] ],
    [ 1428, "瑞穂改", [12, 12, 8] ],
    [ 386, "日進甲", [8, 8, 12, 4], "xxxooxxxxoox" ],
    [ 250, "秋津洲改", [1, 1, 1], "xxxooxxxxoox" ],
    [ 1452, "Commandant Teste改", [12, 12, 7, 7] ],
  ]],
  [ "揚陸艦", "oxxxxxxxxxxx", [
    [ 166, "あきつ丸改", [8, 8, 8] ],
    [ 426, "神州丸改", [2, 2, 4, 8], "xxxooxxxxox" ],
  ]],
  [ "潜水母艦", "xxxoxxxxxoxx", [
    [ 184, "大鯨", [2, 3, 3] ],
    [ 439, "迅鯨改", [2, 2, 2], "xxxooxxxxoxx" ],
  ]],
  [ "補給艦", "xxxooxxxxoxx", [
    [ 300, "神威改母", [1, 1, 1], "xxxooxxxxoox" ],
    [ 1432, "速吸改", [6, 3, 1], "xoxooxxxxoxx" ],
  ]],
  [ "潜水空母", "xxxooxxxxoxx", [
    [ [1454, 1455], "伊13改/伊14改", [2, 1, 0] ],
    [ [1503, 1506], "伊400改/伊401改", [3, 3] ],
    [ [1499, 1500, 1501, 1447], "[伊8/伊19/伊26/伊58]改", [1, 1] ],
  ]],
  [ "-----" ],
  [ "正規空母/装甲空母 (改造前)", "oooxxxxxoxxx", [
    [ 6, "赤城", [18, 18, 27, 10] ],
    [ 1377, "赤城改", [20, 20, 32, 10] ],
    [ 7, "加賀", [18, 18, 45, 12] ],
    [ 1378, "加賀改", [20, 20, 46, 12] ],
    [ [8, 9], "蒼龍/飛龍", [12, 27, 18, 7] ],
    [ [1379, 1380], "蒼龍改/飛龍改", [18, 27, 18, 10] ],
    [ [106, 107], "翔鶴/瑞鶴", [21, 21, 21, 12] ],
    [ [1388, 108], "翔鶴改/瑞鶴改", [24, 24, 24, 12] ],
    [ [201, 202, 203], "雲龍/天城/葛城", [18, 24, 3, 6] ],
    [ 153, "大鳳", [18, 18, 18, 7] ],
    [ 232, "Graf Zeppelin", [20, 13, 10] ],
    [ 244, "Aquila", [10, 26, 15]],
    [ 233, "Saratoga", [27, 19, 19, 15] ],
    [ 238, "Saratoga改", [36, 18, 18, 18] ],
    [ 349, "Intrepid", [37, 36, 19, 4] ],
    [ 403, "Hornet", [36, 18, 18, 15] ],
    [ 315, "Ark Royal", [18, 30, 12, 12] ],
  ]],
  [ "軽空母 (改造前)", "oooxxxxxoxxx", [
    [ 25, "鳳翔", [8, 11] ],
    [ 30, "龍驤", [9, 24, 5] ],
    [ 1381, "龍驤改", [9, 24, 5, 5] ],
    [ 185, "龍鳳", [18, 7, 6] ],
    [ [94, 112], "祥鳳/瑞鳳", [18, 9, 3] ],
    [ 113, "瑞鳳改", [18, 12, 12, 6] ],
    [ [65, 66], "飛鷹/隼鷹", [12, 18, 18, 10] ],
    [ 1384, "隼鷹改", [18, 18, 18, 12] ],
    [ [104, 105], "千歳航/千代田航", [21, 9, 6] ],
    [ [1391, 1392], "千歳航改/千代田航改", [24, 16, 8, 8] ],
    [ 321, "春日丸", [14, 9] ],
    [ 326, "大鷹", [14, 11, 2] ],
    [ 1460, "大鷹改", [14, 14, 5, 3] ],
    [ 324, "神鷹", [9, 18, 6] ],
    [ 1461, "神鷹改", [9, 18, 6, 3] ],
    [ 344, "Gambier Bay", [16, 12] ],
  ]],
  [ "航空戦艦 (改造前)", "xxxooxxxxoxx", [
    [ [1386, 1387], "扶桑改/山城改", [10, 10, 10, 10] ],
    [ [102, 103], "伊勢改/日向改", [11, 11, 11, 14] ],
  ]],
  [ "航空巡洋艦 (改造前)", "xxxooxxxxoxx", [
    [ [129, 130], "鈴谷改/熊野改", [5, 6, 5, 6] ],
  ]],
  [ "戦艦 (改造前)", "xxxoxxxxxoxx", [
    [ [1375, 1376], "長門改/陸奥改", [3, 3, 3, 3] ],
    [ 148, "武蔵改", [7, 7, 7, 7] ],
  ]],
  [ "重巡洋艦 (伊艦) (改造前)", "xxxooxxxxoxx", [
    [ 1438, "Zara改", [2, 2, 2, 2] ],
  ]],
  [ "軽巡洋艦 (改造前)", "xxxxoxxxxoxx", [
    [ 374, "Gotland", [2, 3, 6] ],
    [ 379, "Gotland改", [1, 1, 1, 1] ],
  ]],
  [ "水上機母艦 (改造前)", "xxxooxxxxoxx", [
    [ [49, 50], "千歳/千代田", [12, 12] ],
    [ [95, 96], "千歳改/千代田改", [12, 6, 6] ],
    [ 251, "瑞穂", [12, 12] ],
    [ [381, 1490], "日進(改)", [8, 8, 12], "xxxooxxxxoox" ],
    [ 245, "秋津洲", [1, 1], "xxxooxxxxoox" ],
    [ 291, "Commandant Teste", [12, 7, 7] ],
  ]],
  [ "揚陸艦 (改造前)", "oxxxxxxxxxxx", [
    [ 421, "神州丸", [2, 2, 8], "xxxoxxxxxox" ],
  ]],
  [ "潜水母艦", "xxxoxxxxxoxx", [
    [ 434, "迅鯨", [1, 1] ],
  ]],
  [ "補給艦 (改造前)", "xxxooxxxxoxx", [
    [ 260, "速吸", [6, 1] ],
  ]],
  [ "潜水空母 (改造前)", "xxxooxxxxoxx", [
    [ [294, 295], "伊13/伊14", [2, 0] ],
    [ [155, 293], "伊400/伊401", [3] ],
  ]],
];

// ID, 艦載機名(短縮), 対空, 迎撃, 対爆, 半径, 防空補正, 改修可否, 艦載機名(正式), アイコン
var eq_data = [
  [ "艦上戦闘機", "kansen", [
    [  19, "九六式艦戦", 3, 0, 0, 3,, 1 ],
    [ 228, "九六式艦戦改", 4, 0, 0, 4,, 0 ],
    [  20, "零戦21型", 5, 0, 0, 7,, 1, "零式艦戦21型" ],
    [  96, "零戦21型 (熟練)", 8, 0, 0, 7,, 1, "零式艦戦21型 (熟練)" ],
    [ 155, "零戦21型 (付岩本)", 9, 0, 0, 7,, 2, "零戦21型 (付岩本小隊)" ],
    [ 181, "零戦32型", 5, 0, 0, 5,, 1, "零式艦戦32型" ],
    [ 182, "零戦32型 (熟練)", 8, 0, 0, 5,, 1, "零式艦戦32型 (熟練)" ],
    [  21, "零戦52型", 6, 0, 0, 6,, 1, "零式艦戦52型" ],
    [ 152, "零戦52型 (熟練)", 9, 0, 0, 6,, 1, "零式艦戦52型 (熟練)" ],
    [ 156, "零戦52型甲 (付岩本)", 11, 0, 0, 6,, 1, "零戦52型甲 (付岩本小隊)" ],
    [ 109, "零戦52型丙 (601空)", 9, 0, 0, 6,, 1, "零戦52型丙 (六〇一空)" ],
    [ 153, "零戦52型丙 (付岩井)", 10, 0, 0, 6,, 1, "零戦52型丙 (付岩井小隊)" ],
    [ 157, "零戦53型 (岩本隊)", 12, 0, 0, 6,, 1, "零式艦戦53型 (岩本隊)" ],
    [  55, "紫電改二", 9, 0, 0, 3,, 0 ],
    [ 271, "紫電改四", 10, 0, 0, 4,, 3 ],
    [  22, "試製烈風 後期型", 10, 0, 0, 5,, 0 ],
    [ 110, "烈風 (601空)", 11, 0, 0, 5,, 2, "烈風 (六〇一空)" ],
    [  53, "烈風一一型", 12, 0, 0, 5,, 0 ],
    [ 335, "烈風改 (試製艦載型)", 10, 0, 0, 4,, 0 ],
    [ 336, "烈風改二", 13, 0, 0, 5,, 0 ],
    // [ 337, "烈風改二 (一航戦)", 14, 0, 0, 6,, 0, "烈風改二 (一航戦/熟練)" ],
    [ 338, "烈風改二戊型", 11, 0, 0, 5,, 0,, "yasen" ],
    [ 339, "烈風改二戊 (一航戦)", 12, 0, 0, 6,, 0, "烈風改二戊型 (一航戦/熟練)", "yasen" ],
    [  56, "震電改", 15, 0, 0, 2,, 0 ],
    [ 158, "Bf109T改", 8, 0, 0, 2,, 0 ],
    [ 159, "Fw190T改", 10, 0, 0, 3,, 0 ],
    [ 353, "Fw190 A-5改 (熟練)", 11, 0, 0, 4,, 0 ],
    [ 184, "Re.2001 OR改", 6, 0, 0, 4,, 1 ],
    [ 189, "Re.2005 改", 11, 0, 0, 3,, 0 ],
    [ 197, "F4F-3", 4, 0, 0, 4,, 1 ],
    [ 198, "F4F-4", 5, 0, 0, 4,, 1 ],
    [ 205, "F6F-3", 8, 0, 0, 5,, 1 ],
    [ 254, "F6F-3N", 8, 0, 0, 5,, 0,, "yasen" ],
    [ 206, "F6F-5", 10, 0, 0, 5,, 1 ],
    [ 255, "F6F-5N", 10, 0, 0, 5,, 0,, "yasen" ],
    [ 375, "XF5U", 12, 0, 0, 4,, 0 ],
    [ 249, "Fulmar", 3, 0, 0, 4,, 0 ],
    [ 252, "Seafire Mk.III改", 9, 0, 0, 4,, 0 ],
  ]],
  [ "艦上攻撃機", "kankou", [
    [  93, "九七式艦攻 (友永隊)", 1, 0, 0, 4,, 1 ],
    [ 143, "九七式艦攻 (村田隊)", 1, 0, 0, 4,, 0 ],
    [  94, "天山12型 (友永隊)", 1, 0, 0, 5, "天山一二型 (友永隊)", 2 ],
    [ 144, "天山12型 (村田隊)", 1, 0, 0, 5, "天山一二型 (村田隊)", 0 ],
    [ 372, "天山12型甲", 1, 0, 0, 5, "天山一二型甲", 0 ],
    [ 373, "天山12型甲改", 1, 0, 0, 5,, 0, "天山一二型甲改 (空六号電探改装備機)", "yakou" ],
    [ 374, "天山12型甲改 (熟練)", 1, 0, 0, 6,, 0, "天山一二型甲改 (熟練/空六号電探改装備機)", "yakou" ],
    [ 342, "流星改 (一航戦)", 2, 0, 0, 6,, 0 ],
    [ 343, "流星改 (一航戦/熟練)", 3, 0, 0, 6,, 0 ],
    [ 188, "Re.2001 G改", 4, 0, 0, 3,, 0 ],
    [ 256, "TBF", 1, 0, 0, 6,, 0 ],
    [ 257, "TBM-3D", 1, 0, 0, 6,, 0,, "yakou" ],
    [ 990, "一般の艦攻 (対空0)", 0, 0, 0, -1,, 1 ],
  ]],
  [ "艦上爆撃機", "kanbaku", [
    [  60, "零戦62型 (爆戦)", 4, 0, 0, 4,, 1, "零式艦戦62型 (爆戦)" ],
    [ 154, "零戦62型 (岩井隊)", 7, 0, 0, 5,, 1, "零戦62型 (爆戦/岩井隊)" ],
    [ 219, "零戦63型 (爆戦)", 5, 0, 0, 4,, 1, "零式艦戦63型 (爆戦)" ],
    [  97, "九九式艦爆 (熟練)", 1, 0, 0, 4,, 0 ],
    [ 100, "彗星 (江草隊)", 1, 0, 0, 5,, 0 ],
    [ 319, "彗星12型 (634空)", 3, 0, 0,, 5, 0, "彗星一二型 (六三四空/三号爆弾搭載機)" ],
    [ 291, "彗星22型 (634空)", 1, 0, 0,, 5, 0, "彗星二二型 (六三四空)" ],
    [ 292, "彗星22型 (634/熟練)", 2, 0, 0,, 6, 0, "彗星二二型 (六三四空/熟練)" ],
    [ 148, "試製南山", 1, 0, 0, 5,, 0 ],
    [ 316, "Re.2001 CB改", 4, 0, 0, 3,, 1 ],
    [ 195, "SBD", 2, 0, 0, 4,, 3 ],
    [ 233, "F4U-1D", 7, 0, 0, 6,, 0 ],
    [ 277, "FM-2", 6, 0, 0, 4,, 0 ],
    [ 248, "Skua", 2, 0, 0, 4,, 1 ],
    [ 991, "一般の艦爆 (対空0)", 0, 0, 0, -1,, 0 ],
  ]],
  [ "水上戦闘機", "suisen", [
    [ 164, "Ro.44水上戦闘機", 2, 0, 0, 3,, 1 ],
    [ 215, "Ro.44水上戦闘機bis", 3, 0, 0, 3,, 1 ],
    [ 165, "二式水戦改", 3, 0, 0, 4,, 1 ],
    [ 216, "二式水戦改 (熟練)", 5, 0, 0, 4,, 1 ],
    [ 217, "強風改", 5, 0, 0, 3,, 1 ],
  ]],
  [ "水上爆撃機", "suijou", [
    [  26, "瑞雲", 2, 0, 0, 5,, 1 ],
    [ 207, "瑞雲 (631空)", 1, 0, 0, 5,, 3, "瑞雲 (六三一空)" ],
    [  79, "瑞雲 (634空)", 2, 0, 0, 5,, 1, "瑞雲 (六三四空)" ],
    [ 237, "瑞雲 (634空/熟練)", 4, 0, 0, 5,, 1, "瑞雲 (六三四空/熟練)" ],
    [  80, "瑞雲12型", 3, 0, 0, 5,, 0 ],
    [  81, "瑞雲12型 (634空)", 3, 0, 0, 5,, 1, "瑞雲12型 (六三四空)" ],
    [ 322, "瑞雲改二 (634空)", 4, 0, 0, 5,, 1, "瑞雲改二 (六三四空)" ],
    [ 323, "瑞雲改二 (634/熟練)", 5, 0, 0, 5,, 0, "瑞雲改二 (六三四空/熟練)" ],
    [  62, "試製晴嵐", 0, 0, 0, 4,, 0 ],
    [ 208, "晴嵐 (631空)", 0, 0, 0, 4,, 0, "晴嵐 (六三一空)" ],
    [ 194, "Laté 298B", 1, 0, 0, 4,, 1 ],
    [ 367, "Swordfish系列", 0, 0, 0, 3,, 1 ],
  ]],
  [ "陸上戦闘機", "rikusen", [
    [ 175, "雷電", 6, 2, 5, 2,, 0,, "kyokusen" ],
    [ 201, "紫電一一型", 8, 1, 1, 3,, 1,, "kyokusen" ],
    [ 202, "紫電二一型 紫電改", 9, 3, 1, 4,, 0,, "kyokusen" ],
    [ 263, "紫電改 (343空)", 11, 4, 2, 4,, 0, "紫電改 (三四三空) 戦闘301", "kyokusen" ],
    [ 333, "烈風改", 10, 2, 6, 4,, 0,, "kyokusen" ],
    [ 334, "烈風改 (352空/熟練)", 11, 3, 7, 4,, 0, "烈風改 (三五二空/熟練)", "kyokusen" ],
    [ 351, "試製 秋水", 2, 0, 8, 1,, 0,, "kyokusen" ],
    [ 352, "秋水", 3, 0, 9, 1,, 0,, "kyokusen" ],
    [ 350, "Me163B", 2, 0, 9, 1,, 0,, "kyokusen" ],
    [ 354, "Fw190 D-9", 12, 3, 3, 3,, 0,, "kyokusen" ],
    [ 221, "一式戦 隼II型", 6, 2, 0, 6,, 1 ],
    [ 222, "一式戦 隼III型甲", 7, 3, 1, 6,, 1 ],
    [ 223, "一式戦 (54戦隊)", 8, 3, 1, 7,, 0, "一式戦 隼III型甲 (54戦隊)" ],
    [ 225, "一式戦 (64戦隊)", 11, 5, 1, 7,, 0, "一式戦 隼II型 (64戦隊)" ],
    [ 176, "三式戦 飛燕", 8, 3, 1, 3,, 1 ],
    [ 177, "三式戦 (第244戦隊)", 9, 4, 3, 4,, 3, "三式戦 飛燕 (飛行第244戦隊)" ],
    [ 185, "三式戦 飛燕一型丁", 9, 3, 2, 4,, 3 ],
    [ 218, "四式戦 疾風", 10, 1, 1, 5,, 3 ],
    [ 250, "Spitfire Mk.I", 7, 1, 2, 4,, 1 ],
    [ 251, "Spitfire Mk.V", 9, 2, 3, 5,, 0 ],
    [ 253, "Spitfire Mk.IX (熟練)", 10, 4, 2, 4,, 0 ],
  ]],
  [ "陸上攻撃機", "rikukou", [
    [ 168, "九六式陸攻", 1, 0, 0, 8,, 0 ],
    [ 169, "一式陸攻", 2, 0, 0, 9,, 0 ],
    [ 170, "一式陸攻 (野中隊)", 3, 0, 0, 9,, 3 ],
    [ 180, "一式陸攻 二二型甲", 3, 0, 0, 10,, 0 ],
    [ 186, "一式陸攻 三四型", 4, 0, 0, 8,, 3 ],
    [ 187, "銀河", 3, 0, 0, 9,, 0 ],
    [ 224, "爆装一式戦 (65戦隊)", 6, 0, 0, 5,, 0, "爆装一式戦 隼III型改 (65戦隊)" ],
    [ 269, "試製東海", 0, 0, 0, 8,, 0,, "shoukai" ],
    [ 270, "東海 (901空)", 0, 0, 0, 8,, 0, "東海 (九〇一空)", "shoukai" ],
  ]],
  [ "噴式戦闘爆撃機", "funshiki", [
    [ 199, "噴式景雲改", 6, 0, 0, 3,, 0 ],
    [ 200, "橘花改", 12, 0, 0, 2,, 0 ],
  ]],
  [ "艦上偵察機", "kantei", [
    [  54, "彩雲", 0, 0, 0, 8, 1.3, 3 ],
    [ 212, "彩雲 (東カロリン空)", 0, 0, 0, 8, 1.3, 0 ],
    [ 273, "彩雲 (偵四)", 2, 0, 0, 7, 1.3, 3 ],
    [  61, "二式艦上偵察機", 1, 0, 0, 5, 1.2, 1 ],
    [ 151, "試製景雲 (艦偵型)", 0, 0, 0, 8, 1.3, 1 ],
  ]],
  [ "水上偵察機", "suijou", [
    [  25, "零式水上偵察機", 1, 0, 0, 7, 1.10, 1 ],
    [ 238, "零偵11型乙", 1, 0, 0, 7, 1.10, 0, "零式水上偵察機11型乙" ],
    [ 239, "零偵11型乙 (熟練)", 1, 0, 0, 7, 1.13, 0, "零式水上偵察機11型乙 (熟練)" ],
    [  59, "零式水上観測機", 2, 0, 0, 3, 1.10, 1 ],
    [ 102, "九八式水偵 (夜偵)", 0, 0, 0, 6, 1.10, 1, "九八式水上偵察機 (夜偵)" ],
    [ 115, "Ar196改", 1, 0, 0, 3, 1.10, 0 ],
    [ 118, "紫雲", 0, 0, 0, 4, 1.13, 0 ],
    [ 163, "Ro.43水偵", 1, 0, 0, 3, 1.10, 1 ],
    [ 171, "OS2U", 1, 0, 0, 3, 1.10, 1 ],
    [ 304, "S9 Osprey", 1, 0, 0, 3, 1.10, 1 ],
    [ 370, "Swordfish Mk.II改", 0, 0, 0, 3, 1.10, 1 ],
    [ 371, "Fairey Seafox改", 1, 0, 0, 3, 1.10, 0 ],
  ]],
  [ "大型飛行艇", "hikoutei", [
    [ 138, "二式大艇", 0, 0, 0, 20, 1.16, 0 ],
    [ 178, "PBY-5A Catalina", 0, 0, 0, 10, 1.16, 0 ],
  ]],
  [ "陸上偵察機", "kantei", [
    [ 311, "二式陸上偵察機", 3, 0, 0, 8, 1.18, 0 ],
    [ 312, "二式陸偵 (熟練)", 3, 0, 0, 9, 1.24, 0, "二式陸上偵察機 (熟練)" ],
  ]],
];

var map_data = [
  [ "護衛せよ！船団輸送作戦", "%E8%AD%B7%E8%A1%9B%E3%81%9B%E3%82%88%EF%BC%81%E8%88%B9%E5%9B%A3%E8%BC%B8%E9%80%81%E4%BD%9C%E6%88%A6", [
    [ "(E-1) 地中海マルタ島沖", [
      [ "[甲] D", [655, 655, 655], 3 ],
      [ "[甲] G <空襲>", [651, 651, 651], 4 ],
      [ "[甲] Boss(J)", [543, 780, 555], 6 ],
      [ "[甲] Boss(O) (前哨)", [747], 7 ],
      [ "[甲] Boss(O) (最終)", [750, 591], 7 ],
      [ "-----" ],
      [ "[乙] D", [654, 654, 654], 3 ],
      [ "[乙] G <空襲>", [651, 650, 650], 4 ],
      [ "[乙] Boss(J) (前哨)", [777, 555], 6 ],
      [ "[乙] Boss(J) (最終)", [778, 555], 6 ],
      [ "[乙] Boss(O) (前哨)", [746], 7 ],
      [ "[乙] Boss(O) (最終)", [749, 591], 7 ],
      [ "-----" ],
      [ "[丙] D", [653, 653, 653], 3 ],
      [ "[丙] G <空襲>", [651, 650], 4 ],
      [ "[丙] Boss(J) (前哨)", [541, 523], 6 ],
      [ "[丙] Boss(J) (最終)", [541, 778], 6 ],
      [ "[丙] Boss(O) (前哨)", [745], 7 ],
      [ "[丙] Boss(O) (最終)", [748], 7 ],
      [ "-----" ],
      [ "[丁] D", [653, 653], 3 ],
      [ "[丁] G <空襲>", [650, 650], 4 ],
      [ "[丁] Boss(O) (前哨)", [745], 7 ],
      [ "[丁] Boss(O) (最終)", [748], 7 ],
    ]],
    [ "(E-2) バレンツ海", [
      [ "[甲] F, G <空襲>", [651, 651, 651] ],
      [ "-----" ],
      [ "[乙] F, G <空襲>", [651, 650, 650] ],
      [ "-----" ],
      [ "[丙] F, G <空襲>", [651, 650] ],
      [ "-----" ],
      [ "[丁] F, G <空襲>", [650, 650] ],
    ]],
    [ "(E-3) ノルウェー北岬沖/北極海", [
      [ "[甲] F, G, H, P <空襲>", [651, 651, 651], 4.1 ],
      [ "[甲] Boss(Z) (前哨)", [615, 615, 595, 595, 555, 592], 7 ],
      [ "[甲] Boss(Z) (最終)", [618, 618, 595, 595, 862], 7 ],
      [ "[甲] 基地空襲", [651, 651, 651], -1 ],
      [ "-----" ],
      [ "[乙] F, G, H, P <空襲>", [651, 650, 650], 4.1 ],
      [ "[乙] Boss(Z) (前哨)", [614, 614, 594, 594, 555, 591], 7 ],
      [ "[乙] Boss(Z) (最終)", [616, 616, 594, 594, 592], 7 ],
      [ "[乙] 基地空襲", [651, 650, 650], -1 ],
      [ "-----" ],
      [ "[丙] F, G, H, P <空襲>", [650, 650, 650], 4.1 ],
      [ "[丙] Boss(Z) (前哨)", [528, 528, 594, 591], 7 ],
      [ "[丙] Boss(Z) (最終)", [614, 614, 594, 594, 555, 591], 7 ],
      [ "[丙] 基地空襲", [650, 650, 650], -1 ],
      [ "-----" ],
      [ "[丁] F, G, H, P <空襲>", [650, 650], 4.1 ],
      [ "[丁] Boss(Z) (前哨)", [525, 525, 594, 591], 7 ],
      [ "[丁] Boss(Z) (最終)", [525, 525, 594, 591, 518], 7 ],
      [ "[丁] 基地空襲", [650, 650], -1 ],
    ]],
    [ "(E-4) ルソン島沖/オルモック沖", [
      [ 0, "[甲] A, B, G <空襲>", [618, 780, 779, 779], 2.1 ],
      [ 1, "[甲] K <空襲>", [618, 780, 779, 779], 5 ],
      [ 2, "[甲] R, S <空襲>", [780, 778, 778, 776], 4.1 ],
      [ 3, "[甲] Y2 <空襲>", [908, 908, 780], 3 ],
      [ 4, "[甲] Y3", [780, 778, 778, 765, 555, 592], 2 ],
      [ 5, "[甲] Y5", [618, 779, 778, 776, 555, 592], 2 ],
      [ 6, "[甲] Boss(Z) (前哨)", [908, 908, 795, 595, 595, 592], 3 ],
      [ 7, "[甲] Boss(Z) (最終)", [908, 908, 795, 795, 897, 862], 3 ],
      [ 8, "[甲] 基地空襲", [618, 780, 779, 779], -1 ],
      [ "-----" ],
      [ 9, "[乙] A, B, G <空襲>", [617, 780, 779], 2.1 ],
      [ 10, "[乙] K <空襲>", [617, 780, 779], 5 ],
      [ 11, "[乙] R, S <空襲>", [780, 778, 778, 776], 4.1 ],
      [ 12, "[乙] Y2 <空襲>", [907, 907, 777], 3 ],
      [ 13, "[乙] Y3", [780, 777, 777, 776, 555, 592], 2 ],
      [ 14, "[乙] Y5", [617, 780, 779, 762, 555, 592], 2 ],
      [ 15, "[乙] Boss(Z) (前哨)", [907, 907, 794, 5942, 555, 592], 3 ],
      [ 16, "[乙] Boss(Z) (最終)", [907, 907, 7942, 895, 555, 592], 3 ],
      [ 17, "[乙] 基地空襲", [617, 780, 779], -1 ],
      [ "-----" ],
      [ 18, "[丙] A, B, G <空襲>", [616, 778, 763], 2.1 ],
      [ 19, "[丙] K <空襲>", [616, 778, 763], 5 ],
      [ 20, "[丙] R, S <空襲>", [780, 777, 776], 4.1 ],
      [ 21, "[丙] Y2 <空襲>", [907, 777, 777], 3 ],
      [ 22, "[丙] Y3", [778, 777, 776, 523, 555, 591], 2 ],
      // [ 23, "[丙] Y5", [], 2 ],
      [ 24, "[丙] Boss(Z) (前哨)", [906, 793, 594, 594, 555, 591], 3 ],
      [ 25, "[丙] Boss(Z) (最終)", [907, 7932, 5942, 555, 591], 3 ],
      [ 26, "[丙] 基地空襲", [616, 778, 763], -1 ],
      [ "-----" ],
      [ 27, "[丁] A, B, G <空襲>", [616, 777, 762], 2.1 ],
      [ 28, "[丁] K <空襲>", [616, 777, 762], 5 ],
      [ 29, "[丁] R, S <空襲>", [778, 777, 776], 4.1 ],
      [ 30, "[丁] Y2 <空襲>", [906, 777], 3 ],
      [ 31, "[丁] Y3", [777, 776, 523, 518], 2 ],
      // [ 32, "[丁] Y5", [], 2 ],
      [ 33, "[丁] Boss(Z) (前哨)", [906, 591, 518], 3 ],
      [ 34, "[丁] Boss(Z) (最終)", [906, 793, 518, 591], 3 ],
      [ 35, "[丁] 基地空襲", [616, 777, 762], -1 ],
    ]],
  ]],
  [ "鎮守府海域", "%E9%8E%AE%E5%AE%88%E5%BA%9C%E6%B5%B7%E5%9F%9F", [
    [ "(1-4) 南西諸島防衛線", [
      [ "H, J", [510, 510] ],
      [ "I", [510] ],
      [ "Boss(L)", [512, 512] ],
    ]],
    [ "(1-5) 鎮守府近海", [
      [ "I", [528] ],
    ]],
    [ "(1-6) 鎮守府近海航路", [
      [ "B", [523] ],
      [ "D", [579, 523, 523] ],
      [ "F", [528, 525] ],
      [ "J", [565, 510, 510] ],
      [ "L", [579, 579, 523] ],
    ]],
  ]],
  [ "南西諸島海域", "%E5%8D%97%E8%A5%BF%E8%AB%B8%E5%B3%B6%E6%B5%B7%E5%9F%9F", [
    [ "(2-1) 南西諸島近海", [
      [ "A", [523] ],
      [ "D", [523, 523] ],
      [ "F, Boss(H)", [525, 525] ],
    ]],
    [ "(2-2) バシー海峡", [
      [ "Boss(K)", [525] ],
    ]],
    [ "(2-3) 東部オリョール海", [
      [ "Boss(N)", [525, 525] ],
    ]],
    [ "(2-4) 沖ノ島海域", [
      [ "F", [523, 523] ],
      [ "L, M", [528, 528] ],
    ]],
    [ "(2-5) 沖ノ島沖", [
      [ "C", [560] ],
      [ "L", [528, 523, 523] ],
      [ "Boss(O)", [528] ],
    ]],
  ]],
  [ "北方海域", "%E5%8C%97%E6%96%B9%E6%B5%B7%E5%9F%9F", [
    [ "(3-1) モーレイ海", [
      [ "D", [523] ],
      [ "Boss(G)", [528] ],
    ]],
    [ "(3-2) キス島沖", [
      [ "A", [523] ],
      [ "K", [528, 528] ],
    ]],
    [ "(3-3) アルフォンシーノ方面", [
      [ "E", [523, 523, 523] ],
      [ "G", [528, 523] ],
      [ "Boss(M)", [523] ],
    ]],
    [ "(3-4) 北方海域全域", [
      [ "C", [523] ],
      [ "G", [528] ],
      [ "M, N", [560, 560] ],
      [ "Boss(P)", [528, 528] ],
    ]],
    [ "(3-5) 北方AL海域", [
      [ "D (Lv90～)", [565, 579, 528] ],
      [ "D (～Lv89)", [565, 579] ],
      [ "E, G (最終)", [560] ],
      [ "H (Lv85～/前哨)", [587, 549, 549, 549, 549, 549] ],
      [ "H (Lv85～/最終)", [588, 549, 549, 549, 549, 549] ],
      [ "H (～Lv84/前哨)", [589, 549, 549, 549, 549, 549] ],
      [ "H (～Lv84/最終)", [590, 549, 549, 549, 549, 549] ],
    ]],
  ]],
  [ "南西海域", "%E5%8D%97%E8%A5%BF%E6%B5%B7%E5%9F%9F", [
    [ "(7-1) ブルネイ泊地沖", [
      [ "B", [560] ],
      [ "C", [579]]
    ]],
    [ "(7-2) タウイタウイ泊地沖", [
      [ "H", [618, 779, 523] ],
      [ "Boss(M) (ｸﾘｱ前)", [618, 779] ],
      [ "Boss(M) (ｸﾘｱ後)", [616, 762] ],
    ]],
    [ "(7-3) ペナン島沖", [
      [ "N", [766, 765, 592] ],
    ]],
  ]],
  [ "西方海域", "%E8%A5%BF%E6%96%B9%E6%B5%B7%E5%9F%9F", [
    [ "(4-1) ジャム島沖", [
      [ "Boss(J)", [523] ],
    ]],
    [ "(4-2) カレー洋海戦", [
      [ "C, E", [560] ],
      [ "D", [528, 528] ],
      [ "Boss(L)", [528] ],
    ]],
    [ "(4-3) リランカ島", [
      [ "F", [528, 523] ],
      [ "H, I", [523] ],
      [ "Boss(N)", [573, 560] ],
    ]],
    [ "(4-4) カスガダマ島", [
      [ "F", [528, 523] ],
      [ "G", [523] ],
      [ "H", [528] ],
      [ "Boss(K)", [545] ],
    ]],
    [ "(4-5) カレー洋リランカ島沖", [
      [ "K", [579, 579] ],
      [ "S", [560] ],
      [ "Boss(T) (前哨)", [573, 549, 549] ],
      [ "Boss(T) (最終)", [613, 549, 549] ],
    ]],
  ]],
  [ "南方海域", "%E5%8D%97%E6%96%B9%E6%B5%B7%E5%9F%9F", [
    [ "(5-1) 南方海域前面", [
      [ "D", [579, 579, 560] ],
      [ "F, G", [523] ],
      [ "Boss(J)", [579, 579] ],
    ]],
    [ "(5-2) 珊瑚諸島沖", [
      [ "C, L", [579, 579] ],
      [ "E, F", [579] ],
      [ "I", [619, 565] ],
      [ "Boss(O)", [619] ],
    ]],
    [ "(5-3) サブ島沖海域", [
      [ "M", [579, 579, 579] ],
      [ "Boss(Q)", [548, 560, 560] ],
    ]],
    [ "(5-4) サーモン海域", [
      [ "G", [615, 615] ],
      [ "Boss(P)", [764] ],
    ]],
    [ "(5-5) サーモン海域北方", [
      [ "H, J", [565, 565] ],
      [ "K", [565, 565, 560] ],
      [ "P", [562] ],
      [ "Boss(S) (ｸﾘｱ前)", [548, 562, 562] ],
      [ "Boss(S) (ｸﾘｱ後)", [565, 528, 562] ],
    ]],
  ]],
  [ "中部海域", "%E4%B8%AD%E9%83%A8%E6%B5%B7%E5%9F%9F", [
    [ "(6-1) 中部海域哨戒線", [
      [ "C", [560] ],
      [ "I", [585, 579] ],
      [ "Boss(K)", [579] ],
    ]],
    [ "(6-2) MS諸島沖", [
      [ "B", [523, 523] ],
      [ "C", [560, 560] ],
      [ "F", [579, 579] ],
      [ "I", [560] ],
      [ "J", [565] ],
      [ "Boss(K)", [579] ],
    ]],
    [ "(6-3) グアノ環礁沖海域", [
      [ "--- 制空戦力なし ---", [] ],
    ]],
    [ "(6-4) 中部北海域ﾋﾟｰｺｯｸ島沖", [
      [ "C", [529, 529, 555, 523], 3 ],
      [ "D, F, G", [669], 2.1 ],
      [ "H", [529, 529, 555, 523], 7 ],
      [ "I", [669, 560], 6 ],
      [ "J (前哨)", [618, 567, 595, 592], 6 ],
      [ "J (最終)", [620, 567, 595, 592], 6 ],
      [ "K (前哨)", [616, 543, 527], 7 ],
      [ "K (最終)", [617, 543, 527], 7 ],
      [ "L", [560, 560, 527], 7 ],
      [ "Boss(N) (前哨)", [671, 653], 5 ],
      [ "Boss(N) (最終)", [656, 555], 5 ],
    ]],
    [ "(6-5) KW環礁沖海域", [
      [ "C", [618, 543, 595, 595], 2 ],
      [ "D", [560, 560, 595, 592], 3 ],
      [ "G", [586, 615, 615, 592], 4 ],
      [ "H (前哨)", [615, 615, 592], 4 ],
      [ "H (最終)", [586, 615, 592], 4 ],
      [ "I (前哨)", [560, 560, 592], 3 ],
      [ "I (最終)", [560, 560, 555, 592], 3 ],
      [ "J", [560, 555, 591], 4 ],
      [ "Boss(M)", [586, 6152, 592, 555, 5272], 5 ],
      [ "基地空襲 (前哨)", [586, 615, 592] ],
      [ "基地空襲 (最終)", [586, 615, 615, 592] ],
    ]],
  ]],
];

// ID (下3桁), 艦名, 対空値, 搭載数, 未確定フラグ
var eship_data = [
  [ "今イベント艦", [
    [ 650, "飛行場姫 (空襲弱)", [3, 3, 3, 3], [12, 12, 8, 4] ],
    [ 651, "飛行場姫 (空襲中)", [5, 3, 3, 3], [16, 16, 12, 4] ],
    [ 652, "飛行場姫 (空襲強)", [5, 5, 3, 3], [24, 24, 16, 8] ],
    [ 655, "集積地棲姫 (甲)", [5, 5, 3, 3], [24, 24, 16, 8] ],
    [ 654, "集積地棲姫 (乙)", [5, 3, 3, 3], [16, 16, 12, 4] ],
    [ 653, "集積地棲姫 (丙丁)", [3, 3, 3, 3], [12, 12, 8, 4] ],
    [ 747, "戦艦仏棲姫 (甲)", [8], [72] ],
    [ 746, "戦艦仏棲姫 (乙)", [8], [64] ],
    [ 745, "戦艦仏棲姫 (丙丁)", [8], [48] ],
    [ 750, "戦艦仏棲姫-壊 (甲)", [8], [81] ],
    [ 749, "戦艦仏棲姫-壊 (乙)", [8], [72] ],
    [ 748, "戦艦仏棲姫-壊 (丙丁)", [8], [64] ],
    [ 908, "空母棲姫改 (甲)", [11, 5, 6, 6], [60, 52, 56, 30] ],
    [ 907, "空母棲姫改 (乙)", [11, 5, 5, 6], [58, 52, 50, 30] ],
    [ 906, "空母棲姫改 (丙丁)", [11, 5, 6], [56, 48, 30] ],
    [ [793, 794, 795], "戦艦水鬼改", [-1], [6] ],
  ]],
  [ "軽空母", [
    [ 510, "軽母ヌ級", [2], [18] ],
    [ 523, "軽母ヌ級elite", [5], [24] ],
    [ 762, "軽母ヌ級elite (白)", [10, 4], [26, 23] ],
    [ 776, "軽母ヌ級elite (鳥白)", [10, 8, 8], [26, 23, 23] ],
    [ 777, "軽母ヌ級elite (黒)", [11, 5, 6], [26, 23, 23] ],
    [ 560, "軽母ヌ級flagship", [5], [22] ],
    [ 763, "軽母ヌ級flagship (白)", [10, 4], [32, 29] ],
    [ 764, "軽母ヌ級flagship (赤)", [12, 5], [32, 29] ],
    [ 734, "軽母ヌ級改elite", [8, 5, 8], [22, 22, 22] ],
    [ 765, "軽母ヌ級改elite (鳥白)", [8, 10, 4], [28, 24, 18] ],
    [ 778, "軽母ヌ級改elite (黒)", [11, 5, 6, 6], [28, 24, 18, 18] ],
    [ 735, "軽母ヌ級改flagship", [9, 5, 9], [28, 24, 20] ],
    [ 766, "軽母ヌ級改flagship (鳥赤)", [9, 12, 5], [28, 28, 20] ],
    [ 779, "軽母ヌ級改flagship (赤)", [12, 5, 5], [28, 20, 20] ],
    [ 780, "軽母ヌ級改flagship (鳥黒)", [11, 5, 6, 9], [28, 28, 20, 20] ],
  ]],
  [ "正規空母", [
    [ 512, "空母ヲ級", [2], [27] ],
    [ 525, "空母ヲ級elite", [5], [30] ],
    [ 528, "空母ヲ級flagship", [5], [32] ],
    [ 579, "空母ヲ級flagship (白)", [10, 4, 4], [32, 27, 5] ],
    [ 614, "空母ヲ級flagship (白赤)", [12, 5, 4], [32, 27, 5] ],
    [ 615, "空母ヲ級flagship (赤)", [12, 5, 5], [32, 27, 5] ],
    [ 565, "空母ヲ級改flagship", [9, 4, 4], [36, 36, 36] ],
    [ 616, "空母ヲ級改flagship (白)", [10, 4, 4], [36, 36, 36] ],
    [ 617, "空母ヲ級改flagship (白赤)", [12, 5, 4], [36, 36, 36] ],
    [ 618, "空母ヲ級改flagship (赤)", [12, 5, 5], [36, 36, 36] ],
    [ 714, "空母ヲ級改flagship (陸爆弱)", [12, 3, 3, 3], [36, 36, 28, 28] ],
    [ 715, "空母ヲ級改flagship (陸爆強)", [12, 5, 5, 5], [36, 36, 36, 28] ],
  ]],
  [ "重巡洋艦", [
    [ 761, "重巡ネ級flagship", [8], [28] ],
  ]],
  [ "戦艦", [
    [ 561, "戦艦レ級", [8], [140] ],
    [ 562, "戦艦レ級elite", [8], [180] ],
  ]],
  [ "その他 (通常海域敵艦)", [
    [ [536, 537, 538], "浮遊要塞", [5], [30] ],
    [ [549, 550, 551], "護衛要塞", [5], [35] ],
    [ 589, "北方棲姫 (3-5前哨/弱)", [9], [64] ],
    [ 587, "北方棲姫 (3-5前哨/強)", [9], [72] ],
    [ 590, "北方棲姫 (3-5最終/弱)", [10, 4], [64, 40] ],
    [ 588, "北方棲姫 (3-5最終/強)", [10, 4], [72, 40] ],
    [ 545, "装甲空母姫", [5], [96] ],
    [ 573, "港湾棲姫", [9], [80] ],
    [ 613, "港湾棲姫 (4-5最終)", [4], [180] ],
    [ 548, "南方棲戦姫", [5], [90] ],
    [ 585, "空母棲鬼", [10, 4], [48, 48] ],
    [ 619, "空母棲鬼 (赤)", [12, 5], [48, 48] ],
    [ 586, "空母棲姫", [10, 4], [60, 56] ],
    [ 620, "空母棲姫 (赤)", [12, 5], [60, 56] ],
    [ 671, "離島棲姫", [7, 7], [32, 32] ],
    [ 668, "離島棲姫 (陸爆弱)", [5, 3, 3, 7], [16, 12, 12, 8] ],
    [ 669, "離島棲姫 (陸爆強)", [5, 3, 7, 7], [20, 18, 18, 8] ],
    [ 653, "集積地棲姫 (6-4)", [3, 3, 3, 3], [12, 12, 8, 4] ],
    [ 656, "集積地棲姫-壊 (6-4)", [5, 3, 3, 3], [16, 16, 12, 4] ],
  ]],
  [ "水上偵察機搭載艦", [
    [ 505, "軽巡ホ級", [-1], [1] ],
    [ 518, "軽巡ホ級elite", [-1], [1] ],
    [ 519, "軽巡ヘ級elite", [-1], [1] ],
    [ 555, "軽巡ヘ級flagship", [-1], [2] ],
    [ 591, "軽巡ツ級", [-1], [3] ],
    [ 592, "軽巡ツ級elite", [-1], [3] ],
    [ 862, "軽巡ツ級flagship", [-1], [3] ],
    [ 509, "重巡リ級", [-1], [3] ],
    [ 522, "重巡リ級elite", [-1, -1], [3, 3] ],
    [ 527, "重巡リ級flagship", [-1], [4] ],
    [ 566, "重巡リ級改flagship", [-2], [4] ],
    [ 594, "重巡ネ級", [-1], [4] ],
    [ 595, "重巡ネ級elite", [-1], [4] ],
    [ [895, 896, 897], "重巡ネ級改", [-2], [4] ],
    [ 529, "戦艦ル級flagship", [-1], [5] ],
    [ 567, "戦艦ル級改flagship", [-2], [5] ],
    [ 541, "戦艦タ級", [-1], [4] ],
    [ 543, "戦艦タ級flagship", [-1], [4] ],
  ]],
  [ "複数艦指定用", [
    [ 6152, "空母ヲ級flagship (赤) x2", [12, 5, 5, 12, 5, 5], [32, 27, 5, 32, 27, 5] ],
    [ 5272, "重巡リ級flagship x2", [-1, -1], [4, 4] ],
    [ 5942, "重巡ネ級 x2", [-1, -1], [4, 4] ],
    [ [7932, 7942, 7952], "戦艦水鬼改 x2", [-1, -1], [6, 6] ],
  ]],
  [ "前イベント艦 (2020夏)", [
    [ [796, 797, 798], "戦艦水鬼改-壊", [-1], [6] ],
    [ 935, "集積地棲姫II夏 (甲)", [5], [88] ],
    [ 934, "集積地棲姫II夏 (乙)", [5], [64] ],
    [ 933, "集積地棲姫II夏 (丙丁)", [5], [48] ],
    [ 938, "集積地棲姫II夏-壊 (甲)", [5], [98] ],
    [ 937, "集積地棲姫II夏-壊 (乙)", [5], [88] ],
    [ 936, "集積地棲姫II夏-壊 (丙丁)", [5], [64] ],
    [ [781, 782], "空母棲姫(黒)", [11, 5, 6], [60, 56, 30] ],
    [ [705, 706, 707], "重巡夏姫", [-2], [4] ],
    [ [790, 791, 792], "戦艦棲姫改", [-1], [4] ],
    [ 682, "リコリス棲姫 (空襲弱)", [5, 3, 12, 7], [24, 24, 24, 24] ],
    [ 683, "リコリス棲姫 (空襲強)", [5, 5, 12, 7], [30, 30, 30, 30] ],
    [ 681, "リコリス棲姫 (甲)", [5, 5, 12, 7], [36, 36, 36, 36] ],
    [ 680, "リコリス棲姫 (乙)", [5, 3, 12, 7], [30, 30, 30, 30] ],
    [ 679, "リコリス棲姫 (丙)", [3, 3, 12, 7], [24, 24, 24, 24] ],
    [ 923, "集積地棲姫II (甲)", [5, 5, 3, 3], [22, 22, 22, 22], 1 ],
    [ 922, "集積地棲姫II (乙)", [5, 3, 3, 3], [12, 12, 12, 12], 1 ],
    [ 921, "集積地棲姫II (丙丁)", [3, 3, 3, 3], [9, 9, 9, 9], 1 ],
    [ 926, "集積地棲姫II-壊 (甲)", [5, 5, 5, 3], [26, 26, 26, 26], 1 ],
    [ 925, "集積地棲姫II-壊 (乙)", [5, 5, 3, 3], [18, 18, 18, 18], 1 ],
    [ 924, "集積地棲姫II-壊 (丙丁)", [5, 3, 3, 3], [14, 14, 14, 14], 1 ],
    [ 961, "空母夏姫 ('20夏/弱)", [12, 5], [45, 44], 1 ],
    [ 962, "空母夏姫 ('20夏/中)", [12, 5], [47, 47], 1 ],
    [ 963, "空母夏姫 ('20夏/強)", [12, 5], [50, 49], 1 ],
    [ 964, "空母夏姫II", [11, 6], [68, 66] ],
    [ 973, "南太平洋空母棲姫 (甲)", [11, 5, 6], [36, 32, 16] ],
    [ 972, "南太平洋空母棲姫 (乙)", [11, 5, 6], [0, 0, 0], 1 ],
    [ 971, "南太平洋空母棲姫 (丙丁)", [11, 5, 6], [22, 22, 11], 1 ],
    [ 976, "南太平洋空母棲姫-壊 (甲)", [11, 5, 6], [72, 36, 30] ],
    [ 975, "南太平洋空母棲姫-壊 (乙)", [11, 5, 6], [0, 0, 0], 1 ],
    [ 974, "南太平洋空母棲姫-壊 (丙丁)", [11, 5, 6], [23, 23, 22], 1 ],
    [ 5432, "戦艦タ級flagship x2", [-1, -1], [4, 4] ],
  ]],
  [ "前々イベント艦 (2020春)", [
    [ 892, "飛行場姫 (重爆弱)", [9, 9, 9], [18, 12, 6] ],
    [ 893, "飛行場姫 (重爆中)", [17, 9, 9, 9], [18, 12, 12, 6], 1 ],
    [ 894, "飛行場姫 (重爆強)", [17, 17, 17, 17], [36, 18, 12, 6] ],
    [ 7772, "軽母ヌ級elite (黒) x2", [11, 5, 6, 11, 5, 6], [26, 23, 23, 26, 23, 23] ],
    [ 7782, "軽母ヌ級改elite (黒) x2", [11, 5, 6, 6, 11, 5, 6, 6], [28, 24, 18, 18, 28, 24, 18, 18] ],
    [ 7802, "軽母ヌ級改flagship (鳥黒) x2", [11, 5, 6, 9, 11, 5, 6, 9], [28, 28, 20, 20, 28, 28, 20, 20] ],
    [ 8622, "軽巡ツ級flagship x2", [-1, -1], [3, 3] ],
    [ 5952, "重巡ネ級elite x2", [-1, -1], [4, 4] ],
    [ [8952, 8962, 8972], "重巡ネ級改 x2", [-2, -2], [4, 4] ],
    [ 594895, "重巡ネ級 + 重巡ネ級改", [-1, -2], [4, 4] ],
  ]],
];

var prof_blue = "#7499be";
var prof_yellow = "#d19504";


/***********************************************************
 *    グローバル変数
 ***********************************************************/

var ship_table = {};
var eq_table = {};
var map_table = {};
var node_table = {};
var eship_table = {};

/**
 * 現在の入力データ
 * @type {Object}
 */
var input_data = {};

/**
 * 現在の入力データに対応するコード文字列
 * @type {string}
 */
var input_data_code;

/**
 * 現在のモードを表す: 0=通常, 1=基地航空隊出撃, 2=基地航空隊防空
 * @type {number}
 */
var is_lbas = 0;

/**
 * 各スロットの偵察機フラグ: 基地航空隊モード時に参照
 * 非偵察機 = 0, 偵察機 = 1, 熟練度固定機 = >=2 (現在は二式陸偵2種)
 * @type {int[]}
 */
var is_recon_slot = [0, 0, 0, 0];

/**
 * sessionStorage および localStorage が利用できるかどうか
 * @type {boolean}
 */
var support_storage;

/**
 * 5スロット目を表示しているかどうか
 * @type {boolean[]}
 */
var show_fifth_slot = [true, true, true]

/**
 * ドラッグを開始したID. 非ドラッグ時は-1
 * @type {int}
 */
var drag_start_id = -1;


/***********************************************************
 *    初期化
 ***********************************************************/

/**
 * セレクトメニュー構築などの初期化を行う
 * @return {void}
 */
function init() {
  var i, $g;

  // 艦船オブジェクト生成
  function gen_ship_object(ship_info, flags) {
    return {
      id: ship_info[0],
      first_id: Array.isArray(ship_info[0]) ? ship_info[0][0] : ship_info[0],
      has_multi_ids: Array.isArray(ship_info[0]),
      name: ship_info[1],
      space: ship_info[2],
      equip_capability: (ship_info[3] || flags).split("").map(function (c) {
        return c === "o";
      })
    };
  }

  // 艦船テーブル構築
  var $ship = $(".ship");
  ship_data.forEach(function (ship_group) {
    $g = $("<optgroup>").attr("label", ship_group[0]);
    if (ship_group[0] === "-----") {
      $ship.append($g.css("text-align", "center").prop("disabled", true));
    } else {
      var flags = ship_group[1];
      ship_group[2].forEach(function (ship_info) {
        var ship = gen_ship_object(ship_info, flags);
        (ship.has_multi_ids ? ship.id : [ship.id]).forEach(function (id) {
          ship_table[id] = ship;
        });
        $g.append($("<option>").text(ship.name).val(ship.first_id));
      });
      $ship.append($g);
    }
  });

  // 艦1に基地航空隊追加
  $g = $("<optgroup>").attr("label", "-----").css("text-align", "center");
  $("#ship0 option:first").after($g.prop("disabled", true));
  $g = $("<optgroup>").attr("label", "基地航空隊");
  $g.append($("<option>").text("基地航空隊 [出撃]").val(1));
  $g.append($("<option>").text("基地航空隊 [防空]").val(2));
  $("#ship0 option:first").after($g);
  ship_table[1] = gen_ship_object([1, "基地航空隊 [出撃]", [18, 18, 18, 18]], "oooooooooooo");
  ship_table[2] = gen_ship_object([2, "基地航空隊 [防空]", [18, 18, 18, 18]], "oooooooooooo");

  // 艦載機オブジェクト生成
  function gen_eq_object(eq_info, plane_type, default_icon) {
    return {
      id: eq_info[0],
      name: eq_info[8] || eq_info[1],
      name_abbr: eq_info[1],
      plane_type: plane_type,
      aa: eq_info[2],
      ic: eq_info[3],
      ab: eq_info[4],
      range: eq_info[5],
      recon_bonus: eq_info[6] || 1,
      can_improve: eq_info[7],
      icon: eq_info[9] || default_icon
    };
  }

  // 艦載機テーブル構築
  var $eq = $(".eq");
  eq_data.forEach(function (eq_group, plane_type) {
    $g = $("<optgroup>").attr("label", eq_group[0]);
    var default_icon = eq_group[1];
    eq_group[2].forEach(function (eq_info) {
      var eq = gen_eq_object(eq_info, plane_type, default_icon);
      var title = eq.name + " - 対空+" + eq.aa;
      if (eq.ab) title += ", 対爆+" + eq.ab;
      if (eq.ic) title += ", 迎撃+" + eq.ic;
      title += ", 改修" + ["不可", "可", "値引継可", "配布有"][eq.can_improve];
      eq_table[eq.id] = eq;
      $g.append($("<option>").text(eq.name_abbr).val(eq.id).attr("title", title));
    });
    $eq.append($g);
  });

  // 艦載機セレクトメニューの幅調整
  $eq.width(Math.ceil($eq.width() * 0.92));

  // 熟練度セレクトメニュー構築
  $(".prof")
    .append($("<option>").text("-").val(0).css("color", "black"))
    .append($("<option>").text("|").val(1).css("color", prof_blue))
    .append($("<option>").text("||").val(2).css("color", prof_blue))
    .append($("<option>").text("|||").val(3).css("color", prof_blue))
    .append($("<option>").text("/").val(4).css("color", prof_yellow))
    .append($("<option>").text("//").val(5).css("color", prof_yellow))
    .append($("<option>").text("///").val(6).css("color", prof_yellow))
    .append($("<option>").text(">>").val(7).css("color", prof_yellow))
    .val(7).css("color", prof_yellow);

  // 艦載機セルの幅調整
  $(".prof").show(); $(".star-span").show();
  $(".td-eq").width($(".td-eq").width() + 2);
  $(".prof").width($(".prof").width());
  $(".prof").hide(); $(".star-span").hide();

  // マップテーブル構築
  var $map = $("#map");
  map_data.forEach(function (map_group, i) {
    $g = $("<optgroup>").attr("label", map_group[0]);
    map_group[2].forEach(function (map, j) {
      var map_id = +map[0][3];
      map_id += 10 * (map[0][1] === "E" ? 0 : +map[0][1]);
      map_table[map_id] = { index: [i, j] };
      $g.append($("<option>").text(map[0]).val(map_id));
    });
    $map.append($g);
  });

  // 敵艦船オブジェクト生成
  function gen_eship_object(eship_info) {
    var eship = {
      id: eship_info[0],
      first_id: Array.isArray(eship_info[0]) ? eship_info[0][0] : eship_info[0],
      has_multi_ids: Array.isArray(eship_info[0]),
      name: eship_info[1],
      aa: eship_info[2],
      space: eship_info[3],
      estim: !!eship_info[4],
      fp: 0, lbas_fp: 0
    };
    eship.aa.forEach(function (aa, i) {
      if (aa > 0)
        eship.fp += Math.floor(aa * Math.sqrt(eship.space[i]));
      if (aa < 0)
        eship.lbas_fp += Math.floor(-aa * Math.sqrt(eship.space[i]));
    });
    return eship;
  }

  // 敵艦船テーブル構築
  var $eship = $(".eship");
  var $enemy_detail = $("#enemy-detail");
  $eship.append($("<option>").text("直接入力").val(1));
  eship_data.forEach(function (eship_group) {
    $g = $("<optgroup>").attr("label", eship_group[0]);
    eship_group[1].forEach(function (eship_info) {
      var eship = gen_eship_object(eship_info);
      (eship.has_multi_ids ? eship.id : [eship.id]).forEach(function (id) {
        eship_table[id] = eship;
      });
      $g.append($("<option>").text(eship.name).val(eship.first_id));
    });
    $eship.append($g);
    if (+$g.children().val() < 5000)
      $enemy_detail.append($g.clone());
  });

  // 道中損耗セレクトメニュー構築
  $(".pre-battle")
    .append($("<option>").text("制空権確保 (2.5%～5.8%)").val(1))
    .append($("<option>").text("航空優勢 (7.5%～17.5%)").val(3))
    .append($("<option>").text("航空均衡 (12.5%～29.1%)").val(5))
    .append($("<option>").text("航空劣勢 (17.5%～40.8%)").val(7))
    .append($("<option>").text("制空権喪失 (25%～58.3%)").val(10));

  // 基地航空隊損耗セレクトメニュー構築
  $(".pre-lbas")
    .append($("<option>").text("制空権確保 (～100%)").val(10))
    .append($("<option>").text("航空優勢 (～80%)").val(8))
    .append($("<option>").text("航空均衡 (～60%)").val(6))
    .append($("<option>").text("航空劣勢 (～40%)").val(4))
    .append($("<option>").text("制空権喪失 (～10%)").val(1));

  // tabindex調整
  var index = 1;
  $("#data-list").attr("tabindex", index++);
  $("#load-data").attr("tabindex", index++);
  $("#remove-data").attr("tabindex", index++);
  $("#save-name").attr("tabindex", index++);
  $("#save-data").attr("tabindex", index++);
  $("#data-url").attr("tabindex", index++);
  $("#copy-url").attr("tabindex", index++);
  for (i = 0; i < 6; ++i)
    $("#ship" + i).attr("tabindex", index++);
  $("input[name='disp-ship-num']").attr("tabindex", index++);
  $("#reset").attr("tabindex", index++);
  for (i = 0; i < 30; ++i) {
    $("#eq"  + i).attr("tabindex", index++);
    $("#prof" + i).attr("tabindex", index++);
    $("#star" + i).attr("tabindex", index++);
    $("#num" + i).attr("tabindex", index++);
    if (i < 4) $("#range-input" + i).attr("tabindex", index++);
  }
  $("#map").attr("tabindex", index++);
  $("#node").attr("tabindex", index++);
  for (i = 0; i < 6; ++i) {
    $("#eship" + i).attr("tabindex", index++);
    $("#efp-input" + i).attr("tabindex", index++);
  }
  for (i = 0; i < 11; ++i)
    $("#max-prof" + i).attr("tabindex", index++);
  $("#prof-check").attr("tabindex", index++);
  $("#prof-uncheck").attr("tabindex", index++);
  $("#enable-pre-battle").attr("tabindex", index++);
  for (i = 0; i < 10; ++i)
    $("#pre-battle" + i).attr("tabindex", index++);
  $("#enable-pre-lbas").attr("tabindex", index++);
  for (i = 0; i < 6; ++i)
    $("#pre-lbas" + i).attr("tabindex", index++);

  // 更新ハンドラの設定
  for (i = 0; i < 6; ++i)
    $("#ship" + i).change(set_ship.bind(null, i));
  $("#map").change(set_map);
  $("#node").change(set_node);
  $("input").on("input", update);
  $("input:radio").off("input").change(update);
  $("input:checkbox").off("input").change(update);
  $("select").change(update);
  $("#data-list").off("change");
  $("#load-data").click(load_data);
  $("#remove-data").click(remove_data);
  $("#save-name").off("input").on("keydown", function (e) { if (e.which === 13) save_data(); });
  $("#save-data").click(save_data);
  $("#copy-url").click(copy_url);
  $("#reset").click(reset);
  for (i = 0; i < 30; ++i) {
    $("#icon" + i).on("dragstart", equip_dragstart.bind(null, i));
    $("#td-eq" + i).on("dragover", equip_dragover.bind(null, i));
    $("#td-eq" + i).on("dragend", equip_dragend.bind(null, i));
    $("#td-eq" + i).on("drop", equip_drop.bind(null, i));
  }
  $("#prof-check").click(prof_check.bind(null, true));
  $("#prof-uncheck").click(prof_check.bind(null, false));
  $("#toggle-pre-lbas-desc").click(toggle_pre_lbas_desc);
  $("#enemy-detail").off("change").change(update_enemy_detail);

  // アイコンのプリロード
  var icons = ["funshiki", "hikoutei", "kanbaku", "kankou", "kansen", "kantei", "kyokusen",
               "rikukou", "rikusen", "shoukai", "suijou", "suisen", "yakou", "yasen"];
  for (i = 0; i < icons.length; ++i) {
    $("<img src='icon/" + icons[i] + ".png'>");
  }

  // ストレージのチェック、読み込みおよび入力の初期化
  support_storage = check_storage();
  load_local_storage();
  init_input_data();
}


/***********************************************************
 *    計算
 ***********************************************************/

/**
 * 全体の再計算を行う
 * @return {void}
 */
function update() {
  toggle_fifth_slot();
  var fp_info = calc_fighter_power();
  var efp_info = calc_enemy_fighter_power();
  print_result(fp_info, efp_info);
  update_data_code();
}

/**
 * 自艦隊の制空値に関する計算を行う
 * @return {Object} 計算結果
 */
function calc_fighter_power() {
  var i, j;
  var disp_ship_num = +get_radio_value("disp-ship-num");
  var eq_num = is_lbas ? 4 : 5 * disp_ship_num;
  if (eq_num === 20) $(".tr-6s").hide();
  else if (eq_num === 30) $(".tr-6s").show();

  var num_limit = [];
  for (i = 0; i < disp_ship_num; ++i) {
    var ship_val = input_data.ship[i];
    var ship_space = ship_val === "0" ? [] : ship_table[ship_val].space;
    for (j = 0; j < 5; ++j)
      num_limit[i * 5 + j] = ship_space.length <= j ? 999 : ship_space[j];
  }

  var use_max_prof = [];
  for (i = 0; i < 11; ++i)
    use_max_prof[i] = get_checkbox_value("max-prof", i);

  var fp = 0;
  var aa_stats = [], num_planes = [], prof_bonuses = [];
  var min_range = 1/0, max_range_recon = 0;
  var sortie_coef = 1.0, defence_coef = 1.0;

  for (i = 0; i < eq_num; ++i) {
    // 5スロ目が非表示の場合はスキップ
    if (i % 5 === 4 && !show_fifth_slot[Math.floor(i / 10)]) continue;

    var eq_val = get_value("eq", i);
    var is_recon_type = +(eq_val !== "0" && eq_table[eq_val].plane_type >= 8);
    if (is_recon_type) {
      is_recon_type += [311, 312].indexOf(eq_table[eq_val].id) + 1;
    }
    if (is_recon_slot[i] !== is_recon_type) {
      if (is_lbas) set_value("num", i, is_recon_type ? 4 : 18);
      if (is_recon_slot[i] >= 2) {
        for (j = 1; j <= 7; ++j) {
          $("#prof" + i).find("option[value='" + j + "']").prop("disabled", false).show();
        }
        set_value("prof", i, 7);
      }
      is_recon_slot[i] = is_recon_type;
    }
    if (is_lbas && is_recon_type) num_limit[i] = 4;
    var num_plane = get_number("num", i, num_limit[i]);

    // 装備未選択
    if (eq_val === "0") {
      $("#icon" + i).html("");
      $("#eq" + i).removeAttr("title");
      $("#fp" + i).text("");
      $("#prof" + i).fadeOut("fast");
      $("#star-span" + i).fadeOut("fast");
      set_value("prof", i, 7);
      set_value("star", i, 0);
      if (is_lbas) $("#fp" + (i + 5)).text("");
      continue;
    }

    var eq = eq_table[eq_val];
    $("#icon" + i).html("<img src='icon/" + eq.icon + ".png' width='24px' height='24px' class='icon-img'>");
    $("#prof" + i).fadeIn("fast");
    if (eq.can_improve) {
      $("#star-span" + i).fadeIn("fast");
    } else {
      set_value("star", i, 0);
      $("#star-span" + i).fadeOut("fast");
    }
    if (!is_lbas && eq.plane_type == 10) {
      set_value("num", i, num_plane = Math.min(num_plane, 1));
    }

    // 対空値
    var aa = eq.aa;
    if (is_lbas === 1) aa += 1.5 * eq.ic; // 出撃
    if (is_lbas === 2) aa += eq.ic + 2 * eq.ab; // 防空

    // 改修補正
    var star = get_number("star", i, 10);
    if ([0, 3, 5].indexOf(eq.plane_type) >= 0)
      aa += 0.2 * star;   // 0.2 * ★: 艦戦、水戦、陸戦
    else if (eq.plane_type === 2)
      aa += 0.25 * star;  // 0.25 * ★: 艦爆
    else if (eq.plane_type === 6)
      aa += 0.5 * Math.sqrt(star);  // 0.5 * √★: 陸攻

    // スロット制空値
    var fp_i = aa * Math.sqrt(num_plane);

    // 熟練度制御
    var prof = +get_value("prof", i);
    if (is_recon_type >= 2) {
      var max_prof = { 311: 0, 312: 2 }[eq.id];
      set_value("prof", i, prof = Math.min(prof, max_prof));
      for (j = max_prof + 1; j <= 7; ++j) {
        $("#prof" + i).find("option[value='" + j + "']").prop("disabled", true).hide();
      }
    }

    if (prof === 0)
      $("#prof" + i).css("color", "black");
    else if (prof <= 3)
      $("#prof" + i).css("color", prof_blue);
    else
      $("#prof" + i).css("color", prof_yellow);

    // 熟練度ボーナス加算
    var prof_bonus = 0;
    if (num_plane) {
      // 表示ボーナス
      if ([0, 3, 5].indexOf(eq.plane_type) >= 0)
        prof_bonus += [0, 0, 2, 5, 9, 14, 14, 22][prof]; // 艦戦、水戦、陸戦
      if (eq.plane_type === 4)
        prof_bonus += [0, 0, 1, 1, 1, 3, 3, 6][prof];    // 水上爆撃機

      // 内部ボーナス
      if (prof === 7 && use_max_prof[eq.plane_type]) ++prof;
      prof_bonus += Math.sqrt([0, 1, 2.5, 4, 5.5, 7, 8.5, 10, 12][prof]);
    }
    fp_i += prof_bonus;

    // 確率分布計算用
    if (num_plane > 0 && !is_recon_type) {
      aa_stats.push(aa);
      num_planes.push(num_plane);
      prof_bonuses.push(prof_bonus);
    }

    // 基地航空隊: 半径および偵察機係数の計算
    if (is_lbas) {
      var range;
      if (eq.range >= 0) {
        $("#fp" + (i + 5)).text(eq.range);
        $("#range-input" + i).hide();
        set_value("range-input", i, 4);
        range = eq.range;
      } else {
        $("#fp" + (i + 5)).text("");
        $("#range-input" + i).show();
        range = get_number("range-input", i, 20);
      }
      min_range = Math.min(range, min_range);

      if (is_recon_type && num_plane) {
        max_range_recon = Math.max(range, max_range_recon);
        sortie_coef = Math.max({ 311: 1.15, 312: 1.18 }[eq.id] || 1.0, sortie_coef);
        defence_coef = Math.max(eq.recon_bonus, defence_coef);
      }
    }

    if (!is_lbas && is_recon_type) fp_i = 0;
    fp_i = Math.floor(fp_i);
    $("#fp" + i).text(fp_i);
    fp += fp_i;

    $("#eq" + i).attr("title", $("#eq" + i + " option:selected").attr("title"));
  }

  var res_obj = {
    fp: fp,
    min_range: min_range,
    max_range_recon: max_range_recon,
    sortie_coef: sortie_coef,
    defence_coef: defence_coef
  };

  if (get_checkbox_value("enable-pre-battle") && !is_lbas) {
    $("#pre-battle-input").fadeIn("fast");
    res_obj.distrib = calc_fp_distribution(aa_stats, num_planes, prof_bonuses);
  } else {
    $("#pre-battle-input").hide();
    for (i = 0; i < 10; ++i) set_value("pre-battle", i, 0);
  }

  return res_obj;
}

/**
 * 道中の状態による損耗後の自艦隊制空値の確率分布を計算する
 * @param {number[]} aa_stats - 各スロットの対空値
 * @param {number[]} num_planes - 各スロットの搭載数
 * @param {number[]} prof_bonuses - 各スロットの熟練度ボーナス
 * @return {number[]} 各制空値の確率
 */
function calc_fp_distribution(aa_stats, num_planes, prof_bonuses) {
  var i, stage;
  var num_dists = {};
  num_planes.forEach(function (num) {
    num_dists[num] = {};
    num_dists[num][num] = 1.0;
  });

  var max_stage = 0;
  for (stage = 0; stage < 10; ++stage) {
    var rand_max = +get_value("pre-battle", stage);
    if (rand_max === 0) continue;
    max_stage = stage + 1;

    var rand_table = [];
    var rand_n = Math.floor(rand_max * 100 / 3) + 1;
    for (i = 0; i < rand_n; ++i) {
      rand_table.push(rand_max / 4 + i / 100);
    }
    rand_table.push(1/0);

    Object.keys(num_dists).forEach(function (num) {
      var cur_dist = num_dists[num];
      var new_dist = {};
      Object.keys(cur_dist).forEach(function (cur_num_str) {
        var cur_num = +cur_num_str;
        var cnt = 1, shot_num = Math.floor(cur_num * rand_table[0] / 10);
        for (i = 0; i < rand_n; ++i) {
          var next_shot_num = Math.floor(cur_num * rand_table[i + 1] / 10);
          if (shot_num !== next_shot_num) {
            var new_num = cur_num - shot_num;
            new_dist[new_num] = (new_dist[new_num] || 0) + cur_dist[cur_num_str] * cnt / rand_n;
            cnt = 1;
          } else ++cnt;
          shot_num = next_shot_num;
        }
      });
      num_dists[num] = new_dist;
    });
  }

  for (stage = 0; stage < Math.min(max_stage + 1, 10); ++stage) {
    $("#tr-pre-battle" + stage).fadeIn("fast");
  }
  for (; stage < 10; ++stage) {
    $("#tr-pre-battle" + stage).hide();
  }

  var fp_dist = {};
  fp_dist[0] = 1.0;
  aa_stats.forEach(function (aa, idx) {
    var add_dist = {};
    var cur_num_dist = num_dists[num_planes[idx]];
    var prof_bonus = prof_bonuses[idx];
    Object.keys(cur_num_dist).forEach(function (cur_num) {
      var cur_fp = Math.floor(+aa * Math.sqrt(cur_num) + prof_bonus);
      add_dist[cur_fp] = (add_dist[cur_fp] || 0) + cur_num_dist[cur_num];
    });
    var new_fp_dist = {};
    Object.keys(fp_dist).forEach(function (cur_fp_str) {
      var cur_prob = fp_dist[cur_fp_str];
      if (cur_prob > 1e-12) {
        var cur_fp = +cur_fp_str;
        Object.keys(add_dist).forEach(function (add_fp) {
          var new_fp = +add_fp + cur_fp;
          new_fp_dist[new_fp] = (new_fp_dist[new_fp] || 0) + cur_prob * add_dist[add_fp];
        });
      }
    });
    fp_dist = new_fp_dist;
  });

  var fp_dist_ary = [], prob_sum = 0;
  Object.keys(fp_dist).forEach(function (fp) {
    prob_sum += fp_dist_ary[fp] = fp_dist[fp];
  });
  return fp_dist_ary.map(function (p) { return p / prob_sum; });
}

/**
 * 敵艦隊の制空値に関する計算を行う
 * @return {Object} 計算結果
 */
function calc_enemy_fighter_power() {
  var efp = 0, efp_fixed = 0;
  var aa_stats = [], num_planes = [];
  var estim = false;

  for (var i = 0; i < 6; ++i) {
    var eship_val = get_value("eship", i), efp_i;

    // 直接入力時
    if (eship_val === "1") {
      $("#efp" + i).text("");
      $("#efp-input" + i).fadeIn("fast");
      efp_i = get_number("efp-input", i, 999);
      efp += efp_i;
      efp_fixed += efp_i;
      continue;
    }
    $("#efp-input" + i).hide();
    set_value("efp-input", i, 0);

    if (eship_val === "0") {
      $("#efp" + i).text("");
      continue;
    }

    var eship = eship_table[eship_val];
    if (eship.estim){
      estim = true;
      if (!eship.fp && !eship.lbas_fp) {
        $("#efp" + i).html("<b style='color:red'>?</b>");
        continue;
      }
    }

    efp_i = eship.fp + (is_lbas ? eship.lbas_fp : 0);
    $("#efp" + i).text((efp_i || "-") + (eship.estim && efp_i ? "?" : ""));
    efp += efp_i;

    eship.aa.forEach(function (aa, j) {
      if (is_lbas || aa > 0) {
        aa_stats.push(Math.abs(aa));
        num_planes.push(eship.space[j]);
      }
    });
  }

  var res_obj = { fp: efp, estim: estim };
  if (get_checkbox_value("enable-pre-lbas") && is_lbas !== 2) {
    $("#pre-lbas-input").fadeIn("fast");
    res_obj.distrib = calc_efp_distribution(aa_stats, num_planes, efp_fixed);
  } else {
    $("#pre-lbas-input").hide();
    for (i = 0; i < 6; ++i) set_value("pre-lbas", i, 0);
  }

  return res_obj;
}

/**
 * 基地航空隊による損耗後の敵艦隊制空値の確率分布を計算する
 * @param {number[]} aa_stats - 各スロットの対空値
 * @param {number[]} num_planes - 各スロットの搭載数
 * @param {number} base - 損耗を計算しない制空値
 * @return {number[]} 各制空値の確率
 */
function calc_efp_distribution(aa_stats, num_planes, base) {
  var i, j;
  var num_dists = {};
  num_planes.forEach(function (num) {
    num_dists[num] = {};
    num_dists[num][num] = 1.0;
  });

  if (is_lbas) set_value("pre-lbas", 5, 0);
  for (var stage = 0; stage < 6; ++stage) {
    var rand_max = +get_value("pre-lbas", stage);
    if (rand_max === 0) continue;

    var rand_table = [];
    var rand_n = (rand_max + 1) * (rand_max + 1);
    for (i = 0; i <= rand_max; ++i)
      for (j = 0; j <= rand_max; ++j)
        rand_table.push(0.65 * i + 0.35 * j);
    rand_table.push(1/0);
    rand_table.sort(function (a, b) { return a - b; });

    Object.keys(num_dists).forEach(function (num) {
      var cur_dist = num_dists[num];
      var new_dist = {};
      Object.keys(cur_dist).forEach(function (cur_num_str) {
        var cur_num = +cur_num_str;
        var cnt = 1, shot_num = Math.floor(cur_num * rand_table[0] / 10);
        for (i = 0; i < rand_n; ++i) {
          var next_shot_num = Math.floor(cur_num * rand_table[i + 1] / 10);
          if (shot_num !== next_shot_num) {
            var new_num = cur_num - shot_num;
            new_dist[new_num] = (new_dist[new_num] || 0) + cur_dist[cur_num_str] * cnt / rand_n;
            cnt = 1;
          } else ++cnt;
          shot_num = next_shot_num;
        }
      });
      num_dists[num] = new_dist;
    });
  }

  var fp_dist = {};
  fp_dist[base] = 1.0;
  aa_stats.forEach(function (aa, idx) {
    var add_dist = {};
    var cur_num_dist = num_dists[num_planes[idx]];
    Object.keys(cur_num_dist).forEach(function (cur_num) {
      var cur_fp = Math.floor(+aa * Math.sqrt(cur_num));
      add_dist[cur_fp] = (add_dist[cur_fp] || 0) + cur_num_dist[cur_num];
    });
    var new_fp_dist = {};
    Object.keys(fp_dist).forEach(function (cur_fp_str) {
      var cur_prob = fp_dist[cur_fp_str];
      if (cur_prob > 1e-12) {
        var cur_fp = +cur_fp_str;
        Object.keys(add_dist).forEach(function (add_fp) {
          var new_fp = +add_fp + cur_fp;
          new_fp_dist[new_fp] = (new_fp_dist[new_fp] || 0) + cur_prob * add_dist[add_fp];
        });
      }
    });
    fp_dist = new_fp_dist;
  });

  var fp_dist_ary = [], prob_sum = 0;
  Object.keys(fp_dist).forEach(function (fp) {
    prob_sum += fp_dist_ary[fp] = fp_dist[fp];
  });
  return fp_dist_ary.map(function (p) { return p / prob_sum; });
}

/**
 * 計算結果をもとに結果の表示を行う
 * @param {Object} fp_info - 自艦隊の制空値に関する情報
 * @param {Object} efp_info - 敵艦隊の制空値に関する情報
 * @return {void}
 */
function print_result(fp_info, efp_info) {
  var i;
  var fp = fp_info.fp;
  var efp = efp_info.fp;

  var border = [efp * 3, Math.ceil(efp * 1.5), Math.floor(efp / 1.5) + 1,
                Math.floor(efp / 3) + 1, 0];

  if (is_lbas) {
    fp = Math.floor(fp * (is_lbas === 1 ? fp_info.sortie_coef : fp_info.defence_coef));
  }

  if (fp_info.distrib == null) {
    fp_info.distrib = [];
    fp_info.distrib[fp] = 1.0;
  }
  if (efp_info.distrib == null) {
    efp_info.distrib = [];
    efp_info.distrib[efp] = 1.0;
  }

  var fp_cum = 0, fp_cum_dist = [];
  var efp_cum = 0, efp_cum_dist = [];
  fp_info.distrib.forEach(function (prob, fp) {
    if (prob != null) {
      fp_cum += prob;
      fp_cum_dist.push([fp_cum, fp]);
    }
  });
  efp_info.distrib.forEach(function (prob, fp) {
    if (prob != null) {
      efp_cum += prob;
      efp_cum_dist.push([efp_cum, fp]);
    }
  });

  function find_fp(p, enemy) {
    var dist = enemy ? efp_cum_dist : fp_cum_dist;
    var lo = -1, hi = dist.length - 1;
    while (hi - lo > 1) {
      var mid = Math.floor((lo + hi) / 2);
      if (dist[mid][0] < p - 1e-9) lo = mid;
      else hi = mid;
    }
    if (dist[hi][0] < p + 1e-9)
      return (dist[hi][1] + dist[hi + 1][1]) / 2;
    return dist[hi][1];
  }

  var is_fp_fixed = fp === find_fp(5e-5, false);
  var is_efp_fixed = efp === find_fp(5e-5, true);
  function fp_paren(str) { return is_fp_fixed ? str : ("(" + str + ")"); }
  function efp_paren(str) { return is_efp_fixed ? str : ("(" + str + ")"); }

  if (is_lbas) {
    $("#lbas-fp-sum").text("自艦隊制空値: " + fp);
    $("#lbas-efp-sum").text(efp_paren("敵艦隊制空値: " + efp + (efp_info.estim && efp ? "?" : "")));
    var border_txt = "確保: " + border[0] + " / 優勢: ";
    if (efp === 0) border_txt += "- / 均衡: - / 劣勢: -";
    else border_txt += border[1] + " / 均衡: " + border[2] + " / 劣勢: " + border[3];
    $("#lbas-border").text(efp_paren(border_txt));

    var node_data = node_table[input_data.node];
    var distance = node_data != null ? (node_data.lbas_distance || 0) : 0;

    if (is_lbas === 1) {
      var bonus = Math.min(Math.round(Math.sqrt(Math.max(fp_info.max_range_recon - fp_info.min_range, 0))), 3);
      var range = fp_info.min_range + bonus;
      var multiple_dist = false;
      if (distance !== Math.floor(distance)) {
        distance = Math.floor(distance);
        multiple_dist = true;
      }
      var range_text = isFinite(range) ? range : "-";
      if (bonus > 0) range_text += " <span class='small'>(" + fp_info.min_range + "+" + bonus + ")</span>";
      if (distance > 0) {
        var needed_txt = "<span" + (distance > range ? " class='bold' style='color:red'" : "") + ">" + distance + (multiple_dist ? "～" : "") + "</span>";
        range_text += " / 要: " + needed_txt;
      }
      $("#lbas-info").html("戦闘行動半径: " + range_text);
    } else {
      var defence_txt = "偵察機補正: " + Math.round(fp_info.defence_coef * 100) + "%";
      if (distance === -1) {
        defence_txt += " / <span id='high-alt' class='tooltip' title='全部隊に含まれるロケット戦闘機のスロット数に応じて、<br>最終的な制空値に高高度補正が掛かります。<br>本計算機は高高度補正に対応していないため、<br>お手数ですが以下の係数を手動で乗じてください:<br>0スロ: 0.5 / 1スロ: 0.8 / 2スロ: 1.1 / 3スロ～: 1.2'><span class='bold' style='color:red'>注:</span> 高高度</span>";
      }
      $("#lbas-info").html(defence_txt);
      $("#high-alt").on("mouseenter", process_tooltip);
    }
  } else {
    $("#border0").text(efp_paren(border[0]));
    for (i = 1; i < 4; ++i)
      $("#border" + i).text(efp === 0 ? "-" : efp_paren(border[i]));
    $("#fp-sum").text(fp_paren(fp));
    $("#efp-sum").text(efp_paren(efp + (efp_info.estim && efp ? "?" : "")));
  }

  $("#pre-battle-result-1p").text(find_fp(0.01, false));
  $("#pre-battle-result-5p").text(find_fp(0.05, false));
  $("#pre-battle-result-median").text(find_fp(0.5, false));
  $("#pre-lbas-result-median").text(find_fp(0.5, true));
  $("#pre-lbas-result-95p").text(find_fp(0.95, true));
  $("#pre-lbas-result-99p").text(find_fp(0.99, true));

  var state_prob = [0, 0, 0, 0, 0];
  var binned_ratio_prob = [];
  fp_info.distrib.forEach(function (fp_prob, fp) {
    if (fp_prob != null) {
      efp_info.distrib.forEach(function (efp_prob, efp) {
        if (efp_prob != null) {
          var prob = fp_prob * efp_prob;
          var state;
          if (fp >= efp * 3) state = 0;
          else if (fp * 3 <= efp) state = 4;
          else if (fp * 2 >= efp * 3) state = 1;
          else if (fp * 3 <= efp * 2) state = 3;
          else state = 2;
          state_prob[state] += prob;
          var binned_ratio = Math.floor((efp === 0 ? 3.5 : Math.min(fp / efp, 3.5)) * 200);
          binned_ratio_prob[binned_ratio] = (binned_ratio_prob[binned_ratio] || 0) + prob;
        }
      });
    }
  });

  var state_order = [0, 1, 2, 3, 4];
  state_order.sort(function (a, b) {
    return state_prob[b] - state_prob[a] || a - b;
  });

  var state_text = ["制空権確保", "航空優勢", "航空均衡", "航空劣勢", "制空権喪失"];
  var state_color = ["green", "green", "black", "black", "red"];
  var result_html = "";

  for (i = 0; i < 5; ++i) {
    var st = state_order[i];
    var p = state_prob[st];
    if (p < 5e-5) break;
    if (i === 2 || i === 4) result_html += "<br>";
    else if (i) result_html += " / ";
    result_html += "<span style='color:" + state_color[st] + "'>" + state_text[st];
    if (p < 1 - 5e-5)
      result_html += " (" + (p * 100).toFixed(2) + "%)";
    result_html += "</span>";
  }
  $("#result").html(result_html);

  var cum_prob = 0;
  var ratio_median = -1, ratio_5p = -1, ratio_95p = -1;
  binned_ratio_prob.forEach(function (prob, binned_ratio) {
    if (prob != null) {
      cum_prob += prob;
      if (ratio_median === -1 && cum_prob >= 0.5) ratio_median = binned_ratio / 200;
      if (ratio_5p === -1 && cum_prob >= 0.05) ratio_5p = binned_ratio / 200;
      if (ratio_95p === -1 && cum_prob >= 0.95) ratio_95p = binned_ratio / 200;
    }
  });

  update_bar(ratio_median, state_color[state_order[0]]);
  update_errorbar(ratio_5p, ratio_95p);
}


/***********************************************************
 *    チャート
 ***********************************************************/

function update_bar(ratio, color) {
  ratio = Math.min(ratio, 3.5);
  var c = color === "green" ? "#089908" : color === "red" ? "#ee3333" : "#808080";
  chart.series[0].data[0].update({ y: ratio, color: c }, true, { duration: 300 });
}

function update_errorbar(ratio_5p, ratio_95p) {
  ratio_5p = Math.min(ratio_5p, 3.5);
  ratio_95p = Math.min(ratio_95p, 3.5);
  if (ratio_5p === ratio_95p) { hide_errorbar(); return; }
  chart.series[1].setVisible(true, false);
  chart.series[1].data[0].update([ratio_5p, ratio_95p], true, { duration: 300 });
}

function hide_errorbar() {
  chart.series[1].setVisible(false);
}

var chart = new Highcharts.Chart("chart", {
  chart: {
    type: "bar",
    backgroundColor: "#f8f8f8",
    marginLeft: 20,
    spacing: [9, 10, 7, 10]
  },
  title: { text: null },
  credits: { enabled: false },
  legend: { enabled: false },
  tooltip: { enabled: false },
  xAxis: { labels: { enabled: false }, lineWidth: 0, tickLength: 0 },
  yAxis: {
    title: { text: null },
    gridLineWidth: 0,
    lineWidth: 1, lineColor: "black",
    tickWidth: 2, tickLength: 6, tickColor: "black",
    tickPositions: [0, 1/3, 2/3, 1.5, 3, 3.5],
    labels: {
      y: 20,
      style: { color: "black", fontSize: "14px" },
      formatter: function() {
        switch (this.value) {
          case 0:   return "喪失";
          case 1/3: return "劣勢";
          case 2/3: return "均衡";
          case 1.5: return "優勢";
          case 3:   return "確保";
          default:  return "";
        }
      }
    }
  },
  series: [
    { data: [0], pointWidth: 9 },
    { type: "errorbar", data: [[0, 0]], color: "#3050ff", whiskerLength: "60%", visible: false }
  ]
});


/***********************************************************
 *    表示切り替え
 ***********************************************************/

/**
 * 5スロット目の表示に関する調整を行う
 * @return {void}
 */
function toggle_fifth_slot() {
  var new_ary = [false, false, false];
  if (!is_lbas) {
    var disp_ship_num = +get_radio_value("disp-ship-num");
    for (var i = 0; i < disp_ship_num; ++i) {
      var ship_val = input_data.ship[i];
      var num_slot = ship_val === "0" ? 4 : ship_table[ship_val].space.length;
      if (num_slot === 5) {
        new_ary[Math.floor(i / 2)] = true;
      }
    }
  }

  if (show_fifth_slot[0] !== new_ary[0]) {
    if (new_ary[0]) {
      var tr4 = $("#tr4").children().slice(6).detach();
      $("#tr4").show();
      $("#tr4").append($("#tr5").children().slice(6).detach());
      $("#tr5").append($("#tr6").children().slice(6).detach());
      $("#tr6").append(tr4);
    } else {
      var tr6 = $("#tr6").children().slice(6).detach();
      $("#tr4").hide();
      $("#tr6").append($("#tr5").children().slice(6).detach());
      $("#tr5").append($("#tr4").children().slice(6).detach());
      $("#tr4").append(tr6);
    }
  }

  if (show_fifth_slot[1] !== new_ary[1]) {
    if (new_ary[1]) {
      var tr9 = $("#tr9").children().slice(6).detach();
      $("#tr9").show();
      $("#tr9").append($("#tr8").children().slice(6).detach());
      $("#tr8").append($("#tr7").children().slice(6).detach());
      $("#tr7").append(tr9);
    } else {
      var tr7 = $("#tr7").children().slice(6).detach();
      $("#tr9").hide();
      $("#tr7").append($("#tr8").children().slice(6).detach());
      $("#tr8").append($("#tr9").children().slice(6).detach());
      $("#tr9").append(tr7);
    }
  }

  if (show_fifth_slot[2] !== new_ary[2]) {
    if (new_ary[2]) {
      var tr14 = $("#tr14").children().slice(6).detach();
      $("#tr14").show();
      $("#tr14").append($("#tr13").children().slice(6).detach());
      $("#tr13").append($("#tr12").children().slice(6).detach());
      $("#tr12").append($("#tr11").children().slice(6).detach());
      $("#tr11").append($("#tr10").children().slice(6).detach());
      $("#tr10").append($("#tr" + (8 + new_ary[1])).children().slice(6).detach());
      $("#tr" + (8 + new_ary[1])).append($("#tr" + (7 + new_ary[1])).children().slice(6).detach());
      $("#tr" + (7 + new_ary[1])).append(tr14);
    } else {
      var tr78 = $("#tr" + (7 + new_ary[1])).children().slice(6).detach();
      $("#tr14").hide();
      $("#tr" + (7 + new_ary[1])).append($("#tr" + (8 + new_ary[1])).children().slice(6).detach());
      $("#tr" + (8 + new_ary[1])).append($("#tr10").children().slice(6).detach());
      $("#tr10").append($("#tr11").children().slice(6).detach());
      $("#tr11").append($("#tr12").children().slice(6).detach());
      $("#tr12").append($("#tr13").children().slice(6).detach());
      $("#tr13").append($("#tr14").children().slice(6).detach());
      $("#tr14").append(tr78);

    }
  }

  if (new_ary[0] && (new_ary[1] || new_ary[2])) {
    $("#tr6 td:eq(6)").css("border-bottom", "0");
    $("#tr7 td:eq(6)").css("border-top", "0");
  } else {
    $("#tr6 td:eq(6)").css("border-bottom", "");
    $("#tr7 td:eq(6)").css("border-top", "");
  }

  if (new_ary[1] && new_ary[2]) {
    $("#tr7 td:eq(6)").css("border-bottom", "0");
    $("#tr8 td:eq(6)").css("border-top", "0");
  } else {
    $("#tr7 td:eq(6)").css("border-bottom", "");
    $("#tr8 td:eq(6)").css("border-top", "");
  }

  show_fifth_slot = new_ary;
}

/**
 * 艦船の設定に伴い、搭載数の変更および装備可能な艦載機の絞り込みを行う
 * @param {number} pos - 変更された艦船の位置
 * @return {void}
 */
function set_ship(pos) {
  var ship_val = get_value("ship", pos), i, k;
  if (pos === 0) {
    var cur_mode = +ship_val;
    if (cur_mode > 2) cur_mode = 0;
    if (is_lbas !== cur_mode) lbas_mode_change(cur_mode);
  }

  if (ship_val === "0") {
    for (i = 0; i < 5; ++i) {
      k = pos * 5 + i;
      set_value("num", k, "");
      $("#num" + k).prop("disabled", false);
      $("#eq" + k).prop("disabled", false);
      $("#eq" + k + " optgroup").prop("disabled", false).show();
    }
    return;
  }

  var ship = ship_table[ship_val];
  for (i = 0; i < 5; ++i) {
    k = pos * 5 + i;
    if (ship.space.length <= i) {
      set_value("eq", k, 0);
      set_value("num", k, "");
      $("#eq" + k).prop("disabled", true);
      $("#num" + k).prop("disabled", true);
      continue;
    }

    $("#eq" + k).prop("disabled", false);
    $("#eq" + k + " optgroup").each(function (k) {
      if (ship.equip_capability[k])
        $(this).prop("disabled", false).show();
      else
        $(this).prop("disabled", true).hide();
    });

    // 装甲空母チェック (試製景雲の処理)
    var cvb_list = [153, 156, 266, 267, 350];
    if (is_lbas || cvb_list.indexOf(ship.first_id) >= 0)
      $("#eq" + k).find("option[value='151']").prop("disabled", false).show();
    else
      $("#eq" + k).find("option[value='151']").prop("disabled", true).hide();

    if ($("#eq" + k).val() == null)
      set_value("eq", k, 0);

    $("#num" + k).prop("disabled", false);
    set_value("num", k, ship.space[i]);
  }
}

/**
 * 基地航空隊モードの切替に伴う表示の調整を行う
 * @param {number} new_mode - 新たなモード
 * @return {void}
 */
function lbas_mode_change(new_mode) {
  if (is_lbas === new_mode) return;

  if (new_mode === 2)
    $("#label-enable-pre-lbas").hide();
  else
    $("#label-enable-pre-lbas").fadeIn("fast");

  // 基地航空隊の出撃・防空切り替えのみ
  if (is_lbas && new_mode) {
    is_lbas = new_mode;
    return;
  }

  var i, $g1, $g2;
  if ((is_lbas = new_mode)) {
    // 基地航空隊
    $(".lbas-tgl").hide();
    $("#lbas-info").show();
    $(".tr-6s").hide();
    $(".td-fleet").attr("colspan", 4);
    $("#radius-title").text("半径");
    $("#td-eq10").attr({ colspan: 4, rowspan: 2 }).css("text-align", "center");
    $("#lbas-result-table").show();
    $("#prof10, #star-span10").hide();
    for (i = 0; i < 4; ++i) {
      is_recon_slot[i] = 0;
      $g1 = $("#eq" + i + " optgroup:eq(5)").detach();
      $g2 = $("#eq" + i + " optgroup:eq(5)").detach();
      $("#eq" + i + " optgroup:first").before($g1, $g2);
    }
  } else {
    // 通常艦隊
    $(".lbas-tgl").show();
    $("#lbas-info").hide();
    $(".td-fleet").attr("colspan", 6);
    $("#radius-title").text("制空");
    $(".range-input").hide();
    set_value_class("range-input", 4);
    $("#td-eq10").attr({ colspan: 1, rowspan: 1 }).css("text-align", "left");
    $("#lbas-result-table").hide();
    for (i = 0; i < 4; ++i) {
      $g1 = $("#eq" + i + " optgroup:first").detach();
      $g2 = $("#eq" + i + " optgroup:first").detach();
      $("#eq" + i + " optgroup:eq(5)").before($g1, $g2);
    }
  }
}

/**
 * 自艦隊の設定をすべてクリアする
 * @return {void}
 */
function reset() {
  for (var i = 0; i < 6; ++i) {
    if (is_lbas && i === 0) continue;
    set_value("ship", i, 0);
    set_ship(i);
  }
  set_value_class("eq", 0);
  set_value_class("pre-battle", 0);
  set_value_class("pre-lbas", 0);
  $("#save-name").val("");
  update();
}

/**
 * 装備スワップ
 * @param {number} i - スワップを行うID
 * @param {number} j - スワップを行うID
 * @return {void}
 */
function equip_swap(i, j) {
  var eqi = input_data.eq[i];
  set_value("eq", i, input_data.eq[j]);
  set_value("eq", j, eqi);
  var profi = input_data.prof[i];
  set_value("prof", i, input_data.prof[j]);
  set_value("prof", j, profi);
  var stari = input_data.star[i];
  set_value("star", i, input_data.star[j]);
  set_value("star", j, stari);
}

/**
 * 装備スワップが可能かどうか
 * @param {number} i - スワップを行うID
 * @param {number} j - スワップを行うID
 * @return {boolean}
 */
function is_equip_swappable(i, j) {
  var shipi = input_data.ship[Math.floor(i / 5)];
  var shipj = input_data.ship[Math.floor(j / 5)];
  var eqi = input_data.eq[i];
  var eqj = input_data.eq[j];
  if ($("#eq" + i).prop("disabled") || $("#eq" + j).prop("disabled")) return false;
  if (shipi !== "0" && eqj !== "0" && !ship_table[shipi].equip_capability[eq_table[eqj].plane_type]) {
    return false;
  }
  if (shipj !== "0" && eqi !== "0" && !ship_table[shipj].equip_capability[eq_table[eqi].plane_type]) {
    return false;
  }
  return true;
}

/**
 * 装備ドラッグ開始時に呼ばれるハンドラ
 * @param {number} i - イベントを発火したID
 * @param {Object} e - イベントオブジェクト
 * @return {void}
 */
function equip_dragstart(i, e) {
  drag_start_id = i;
}

/**
 * 装備ドラッグオーバー時に呼ばれるハンドラ. マウスカーソルを変更するためだけに利用
 * @param {number} i - イベントを発火したID
 * @param {Object} e - イベントオブジェクト
 * @return {void}
 */
function equip_dragover(i, e) {
  if (is_equip_swappable(drag_start_id, i)) {
    e.preventDefault();
  }
}

/**
 * 装備ドラッグ終了時に呼ばれるハンドラ
 * @param {number} i - イベントを発火したID
 * @param {Object} e - イベントオブジェクト
 * @return {void}
 */
function equip_dragend(i, e) {
  drag_start_id = -1;
}

/**
 * 装備ドロップ時に呼ばれるハンドラ
 * @param {number} i - イベントを発火したID
 * @param {Object} e - イベントオブジェクト
 * @return {void}
 */
function equip_drop(i, e) {
  e.preventDefault();
  if (is_equip_swappable(drag_start_id, i)) {
    equip_swap(drag_start_id, i);
    update();
  }
  drag_start_id = -1;
}

/**
 * 海域の変更に伴いマスの情報を変更する
 * @return {void}
 */
function set_map() {
  var $node = $("#node");
  var map_val = get_value("map");
  if (map_val === "0") {
    $node.html($("<option>").text("--- 海域を選択 ---").val(0)).val(0);
    node_table = { 0: { enemies: [] } };
    set_node();
    $("#mapguide").hide();
    return;
  }

  var index = map_table[map_val].index;
  var node_data = map_data[index[0]][2][index[1]][1];
  $node.empty();
  node_table = {};

  node_data.forEach(function (node, i) {
    var node_id = i, ofs = 0;
    if (typeof node[0] === "number") {
      node_id = node[0];
      ofs = 1;
    }
    node_table[node_id] = { enemies: node[ofs + 1] };
    if (node[ofs + 2] != null) node_table[node_id].lbas_distance = node[ofs + 2];

    var $opt = $("<option>").text(node[ofs]).val(node_id);
    if (node[ofs] === "-----")
      $opt.css("text-align", "center").prop("disabled", true).val("-----");
    $node.append($opt);
  });

  var url = "http://wikiwiki.jp/kancolle/?" + map_data[index[0]][1];
  if (Math.floor(map_val / 10) === 0) url += "/E" + (map_val % 10) + "#area"; else  // イベント海域
  url += "#area" + (map_val % 10);
  $("#mapguide").show();
  $("#maplink").attr("href", url);

  $node.children().first().prop("selected", true);
  set_node();
}

/**
 * マスの変更に伴い敵艦を変更する
 * @return {void}
 */
function set_node() {
  var i = 0;
  var enemies = node_table[get_value("node")].enemies;
  for (; i < enemies.length; ++i)
    set_value("eship", i, eship_table[enemies[i]].first_id);
  for (; i < 6; ++i)
    set_value("eship", i, 0);
}

/**
 * 内部熟練度120として扱うかどうかのチェックボックスを全て変更する
 * @param {*} arg - チェックを入れるかどうか。booleanとして解釈される
 * @return {void}
 */
function prof_check(arg) {
  set_checkbox_value_class("max-prof", arg);
  update();
}

/**
 * 基地航空隊による敵機損耗に関しての詳細表示を切り替える
 * @return {void}
 */
function toggle_pre_lbas_desc() {
  if ($("#toggle-pre-lbas-desc").text()[0] === "＋") {
    $("#toggle-pre-lbas-desc").text("－ 詳細を表示する");
    $("#pre-lbas-description").show("fast");
  } else {
    $("#toggle-pre-lbas-desc").text("＋ 詳細を表示する");
    $("#pre-lbas-description").hide("fast");
  }
}

/**
 * 敵艦スロット情報の表示を更新する
 * @return {void}
 */
function update_enemy_detail() {
  var eship_val = $("#enemy-detail").val();
  if (eship_val === "0") {
    $("#enemy-detail-right").empty();
    $("#enemy-detail-bottom").text("--- ここに情報が表示されます ---");
    return;
  }
  var eship = eship_table[eship_val];

  var id_string = "1" + (eship.has_multi_ids ? eship.id.join(", 1") : eship.id);
  var right_txt = "　ID: " + id_string + "　制空値: " + eship.fp;
  if (eship.estim && eship.fp) right_txt += "?";
  if (eship.lbas_fp) right_txt += " (" + (eship.fp + eship.lbas_fp) + (eship.estim ? "?" : "") + ")";
  $("#enemy-detail-right").text(right_txt);

  if (eship.aa.length === 0) {
    $("#enemy-detail-bottom").text("--- 敵艦情報不明 ---");
    return;
  }

  var bottom_txt = "";
  eship.aa.forEach(function (a, i) {
    if (i) bottom_txt += "<br>";
    bottom_txt += "スロット" + (i + 1) + " [搭載" + eship.space[i] + "]: ";
    if (a < 0) bottom_txt += "<偵察機> ";
    var slot_fp = Math.floor(Math.abs(a) * Math.sqrt(eship.space[i]));
    bottom_txt += "対空+" + Math.abs(a) + " 制空値";
    bottom_txt += a < 0 ? "0(" + slot_fp + ")" : slot_fp;
  });
  $("#enemy-detail-bottom").html(bottom_txt);
}


/***********************************************************
 *    HTML要素の値の取得・変更
 ***********************************************************/

/**
 * IDの先頭に "#" を付加し、必要に応じて番号を末尾に付加した文字列を返す
 * @param {string} id - 要素のベースID
 * @param {number=} index - 番号を付加する場合はその数値
 * @return {string} HTML上のIDを表す文字列
 */
function id_str(id, index) {
  if (index == null) return "#" + id;
  return "#" + id + index;
}

/**
 * input/select要素の値を取得し、input_dataを更新する
 * @param {string} id - 要素のベースID
 * @param {number=} index - 番号
 * @return {string} 取得した値
 */
function get_value(id, index) {
  var value = $(id_str(id, index)).val();
  if (index == null)
    return (input_data[id] = value);
  return (input_data[id][index] = value);
}

/**
 * input/select要素の値を変更し、input_dataを更新する
 * @param {string} id - 要素のベースID
 * @param {?number} index - 番号
 * @param {*} value - 更新する値
 * @return {string} 引数valueと同じ (ただし文字列に変換される)
 */
function set_value(id, index, value) {
  var value_str = String(value);
  $(id_str(id, index)).val(value_str);
  if (index == null)
    return (input_data[id] = value_str);
  return (input_data[id][index] = value_str);
}

/**
 * 特定のクラスのinput/select要素の値すべてを変更し、input_dataを更新する
 * @param {string} class_name - 要素のクラス名
 * @param {*} value - 更新する値
 * @return {string} 引数valueと同じ (ただし文字列に変換される)
 */
function set_value_class(class_name, value) {
  var value_str = String(value);
  var $class = $("." + class_name).val(value_str);
  input_data[class_name] = [];
  for (var i = 0; i < $class.length; ++i)
    input_data[class_name][i] = value_str;
  return value_str;
}

/**
 * input[type="radio"]要素の値を取得し、input_dataを更新する
 * @param {string} name - 要素のname
 * @return {string} 取得した値
 */
function get_radio_value(name) {
  var value = $("input[name='" + name + "']:checked").val();
  return (input_data[name] = value);
}

/**
 * input[type="radio"]要素の値を変更し、input_dataを更新する
 * @param {string} name - 要素のname
 * @param {*} value - 更新する値
 * @return {string} 引数valueと同じ (ただし文字列に変換される)
 */
function set_radio_value(name, value) {
  var value_str = String(value);
  $("input[name='" + name + "']").val([value_str]);
  return (input_data[name] = value_str);
}

/**
 * input[type="checkbox"]要素の値を取得し、input_dataを更新する
 * @param {string} id - 要素のベースID
 * @param {number=} index - 番号
 * @return {boolean} 取得した値
 */
function get_checkbox_value(id, index) {
  var value = $(id_str(id, index)).prop("checked");
  if (index == null)
    return (input_data[id] = value);
  return (input_data[id][index] = value);
}

/**
 * input[type="checkbox"]要素の値を変更し、input_dataを更新する
 * @param {string} id - 要素のベースID
 * @param {?number} index - 番号
 * @param {*} value - 更新する値 (booleanとして解釈される)
 * @return {boolean} 引数valueと同じ (ただしbooleanに変換される)
 */
function set_checkbox_value(id, index, value) {
  var value_bool = !!value;
  $(id_str(id, index)).prop("checked", value_bool);
  if (index == null)
    return (input_data[id] = value_bool);
  return (input_data[id][index] = value_bool);
}

/**
 * 特定のクラスのinput[type="checkbox"]要素の値すべてを変更し、input_dataを更新
 * @param {string} class_name - 要素のクラス名
 * @param {*} value - 更新する値 (booleanとして解釈される)
 * @return {boolean} 引数valueと同じ (ただしbooleanに変換される)
 */
function set_checkbox_value_class(class_name, value) {
  var value_bool = !!value;
  var $class = $("." + class_name).prop("checked", value_bool);
  input_data[class_name] = [];
  for (var i = 0; i < $class.length; ++i)
    input_data[class_name][i] = value_bool;
  return value_bool;
}

/**
 * input[type="number"]要素に入力された数値を取得し、input_dataを更新する。
 * 数値は非負かつ指定した最大値以下の整数に制限される
 * @param {string} id - 要素のベースID
 * @param {?number} index - 番号
 * @param {number} max - 許容する数値の最大値
 * @return {number} 取得した数値
 */
function get_number(id, index, max) {
  var v = $(id_str(id, index)).val();
  if (v === "") {
    set_value(id, index, "");
    return 0;
  }
  var num = +v;
  if (isNaN(num)) num = 0;
  num = Math.min(Math.max(Math.floor(num), 0), max);
  set_value(id, index, num);
  return num;
}


/***********************************************************
 *    登録編成管理
 ***********************************************************/

/**
 * sessionStorage および localStorage が利用できるかどうか確認する
 * @return {boolean} 両方利用できる場合に真
 */
function check_storage() {
  try {
    var item = "__test__";
    sessionStorage.setItem(item, item);
    sessionStorage.removeItem(item);
    localStorage.setItem(item, item);
    localStorage.removeItem(item);
    return true;
  } catch (e) {
    return false;
  }
}

/**
 * ローカルストレージに保存されている登録編成群を読み込む
 * @return {void}
 */
function load_local_storage() {
  if (!support_storage) return;
  var data_str = localStorage.getItem("kcc-as-data");
  if (data_str == null) return;
  var $data_list = $("#data-list").empty();
  JSON.parse(data_str).forEach(function (p) {
    $data_list.append($("<option>").text(p[0]).val(p[1]));
  });
  $data_list.children().first().prop("selected", true);
  $("#load-data").prop("disabled", false);
  $("#remove-data").prop("disabled", false);
}

/**
 * 現在選択されている登録編成を読み込む
 * @return {void}
 */
function load_data() {
  var $selected = $("#data-list option:selected");
  load_data_code($selected.val());
  $("#save-name").val($selected.text());
  show_tooltip("load-data", "編成を読み込みました", 2500);
}

/**
 * 現在選択されている登録編成を削除する
 * @return {void}
 */
function remove_data() {
  if (!enable_data_removal) {
    show_tooltip(
      "remove-data",
      "本当に編成を削除しますか？<br>削除する場合はもう一度クリックしてください",
      6000,
      function () { enable_data_removal = false; }
    );
    enable_data_removal = true;
    return;
  }

  var $data_list = $("#data-list");
  var name = $data_list.children().filter(":selected").text();

  var data = JSON.parse(localStorage.getItem("kcc-as-data"));
  var index = 0;
  for (; index < data.length; ++index)
    if (name === data[index][0]) break;

  data.splice(index, 1);
  $data_list.empty();
  if (data.length === 0) {
    localStorage.removeItem("kcc-as-data");
    $data_list.append($("<option>").text("--- 登録編成なし ---"));
    $("#load-data").prop("disabled", true);
    $("#remove-data").prop("disabled", true);
  } else {
    localStorage.setItem("kcc-as-data", JSON.stringify(data));
    data.forEach(function (p) {
      $data_list.append($("<option>").text(p[0]).val(p[1]));
    });
  }

  $data_list.children().eq(Math.min(index, data.length - 1)).prop("selected", true);
  show_tooltip("remove-data", "編成を削除しました", 2500);
}
var enable_data_removal = false;

/**
 * 現在の編成を保存する
 * @return {void}
 */
function save_data() {
  var name = $("#save-name").val();
  if (name === "") {
    show_tooltip("save-data", "編成名を入力してください", 3000);
    return;
  }

  if (!support_storage) {
    show_tooltip("save-data", "編成の保存に失敗しました:<br>Webストレージが利用できません", 5000);
    return;
  }

  var data_str = localStorage.getItem("kcc-as-data");
  var data, index = 0;

  if (data_str == null) {
    data = [];
    $("#load-data").prop("disabled", false);
    $("#remove-data").prop("disabled", false);
  } else {
    data = JSON.parse(data_str);
    for (; index < data.length; ++index)
      if (name === data[index][0]) break;
  }

  data[index] = [name, input_data_code];
  localStorage.setItem("kcc-as-data", JSON.stringify(data));

  // localStorageは他のタブからも操作され得るため、編成リストを完全に作り直す
  var $data_list = $("#data-list").empty();
  data.forEach(function (p) {
    $data_list.append($("<option>").text(p[0]).val(p[1]));
  });
  $data_list.children().eq(index).prop("selected", true);

  show_tooltip("save-data", "編成を保存しました", 2500);
}

/**
 * 現在の編成のURLをコピーする
 * @return {void}
 */
function copy_url() {
  // iOS Safari対策
  if (navigator.userAgent.match(/iP(hone|ad|od)/)) {
    var range = document.createRange();
    range.selectNodeContents($("#data-url")[0]);
    var selection = getSelection();
    selection.removeAllRanges();
    selection.addRange(range);
    $("#data-url")[0].setSelectionRange(0, 9999);
  } else {
    $("#data-url").select();
  }

  if (document.execCommand("copy"))
    show_tooltip("copy-url", "URLをクリップボードにコピーしました", 2500);
  else
    show_tooltip("copy-url", "URLをコピーできませんでした:<br>テキストボックスを手動でコピーしてください", 5000);
}


/***********************************************************
 *    input_data <=> 数値シーケンス 間の変換
 ***********************************************************/

/**
 * グローバル変数input_dataの初期化を行う。
 * URLパラメータがあるか、セッションストレージにデータがある場合はロードも行う
 * @return {void}
 */
function init_input_data() {
  function make_array(len, value) {
    var ary = new Array(len);
    for (var i = 0; i < len; ++i) ary[i] = value;
    return ary;
  }

  var d = input_data;

  d.ship = make_array(6, "0");
  d["disp-ship-num"] = "4";
  d.eq = make_array(30, "0");
  d.prof = make_array(30, "7");
  d.star = make_array(30, "0");
  d.num = make_array(30, "");
  d["range-input"] = make_array(4, "4");
  d.map = "0";
  d.node = "0";
  d.eship = make_array(6, "0");
  d["efp-input"] = make_array(6, "0");
  d["max-prof"] = [true, false, false, true, false,
                   true, false, false, false, false, false];
  d["enable-pre-battle"] = false;
  d["pre-battle"] = make_array(10, "0");
  d["enable-pre-lbas"] = false;
  d["pre-lbas"] = make_array(6, "0");

  var url_code = get_url_params().c;
  var session_code = support_storage ?
                     sessionStorage.getItem("kcc-as-code") :
                     null;
  update_data_code();

  // URLパラメータに不正なコードが仕込まれる危険性に注意する
  if (url_code != null) {
    try {
      load_data_code(url_code);
    } catch (e) {
      load_data_code(session_code || input_data_code);
    }
    return;
  }

  if (session_code != null) {
    load_data_code(session_code);
    return;
  }

  update();
}

/**
 * 現在の入力内容に応じてinput_data_codeを更新する。
 * sessionStorageへの保存およびURL欄の更新も行う
 * @return {void}
 */
function update_data_code() {
  var e = new CodeEncoder();
  e.push_number(code_version);
  e.push_number(event_id);

  var i;
  var d = input_data;

  for (i = 0; i < 6; ++i)
    e.push_number(d.ship[i]);
  e.push_number(d["disp-ship-num"]);

  for (i = 0; i < 30; ++i)
    e.push_number(d.eq[i]);
  for (i = 0; i < 30; ++i)
    e.push_number(7 - d.prof[i]);
  for (i = 0; i < 30; ++i)
    e.push_number(+d.star[i]);
  for (i = 0; i < 30; ++i)
    e.push_number(+d.num[i]);
  for (i = 0; i < 4; ++i)
    e.push_number(+d["range-input"][i]);

  e.push_number(d.map);
  e.push_number(d.node);

  for (i = 0; i < 6; ++i)
    e.push_number(d.eship[i] >= 500 ? d.eship[i] - 500 : d.eship[i]);
  for (i = 0; i < 6; ++i)
    e.push_number(+d["efp-input"][i]);

  for (i = 0; i < 11; ++i)
    e.push_number(+d["max-prof"][i]);

  e.push_number(+d["enable-pre-battle"]);
  for (i = 0; i < 10; ++i)
    e.push_number(d["pre-battle"][i]);

  e.push_number(+d["enable-pre-lbas"]);
  for (i = 0; i < 6; ++i)
    e.push_number(d["pre-lbas"][i]);

  input_data_code = e.generate_code();
  if (support_storage)
    sessionStorage.setItem("kcc-as-code", input_data_code);
  $("#data-url").val("http://kancollecalc.jp/air_supremacy.html?c=" + input_data_code);
}

/**
 * コードを読み込み入力内容を変更する
 * @param {string} code - エンコードされたコード
 * @return {void}
 * @throws {Error} コードが不正な場合
 */
function load_data_code(code) {
  var i, n;
  var d = new CodeDecoder(code);
  var version = d.pop_number();
  if (version < 1 && 3 < version)
    throw new Error("load_data_code: invalid version number: " + version);
  var is_same_event_id = event_id === d.pop_number();

  for (i = 0; i < 6; ++i) {
    n = d.pop_number();
    if (ship_table[n] != null)
      set_value("ship", i, ship_table[n].first_id);
    else
      set_value("ship", i, 0);
    set_ship(i);
  }
  n = d.pop_number();
  if (n !== 4 && n !== 6) n = 4;
  set_radio_value("disp-ship-num", n);

  for (i = 0; i < 30; ++i) {
    n = i % 5 !== 4 || version >= 2 ? d.pop_number() : 0;
    if (eq_table[n] == null) n = 0;
    set_value("eq", i, n);
  }
  for (i = 0; i < 30; ++i)
    set_value("prof", i, Math.max(i % 5 !== 4 || version >= 2 ? 7 - d.pop_number() : 7, 0));
  for (i = 0; i < 30; ++i)
    set_value("star", i, Math.min(i % 5 !== 4 || version >= 2 ? d.pop_number() : 0, 10));
  for (i = 0; i < 30; ++i)
    set_value("num", i, Math.min(i % 5 !== 4 || version >= 2 ? d.pop_number() : 0, 999) || "");
  for (i = 0; i < 4; ++i)
    set_value("range-input", i, Math.min(d.pop_number(), 20));

  n = d.pop_number();
  if (map_table[n] == null || (n < 10 && !is_same_event_id)) n = 0;
  set_value("map", null, n);
  set_map();
  n = d.pop_number();
  if (node_table[n] == null) n = 0;
  set_value("node", null, n);
  set_node();

  for (i = 0; i < 6; ++i) {
    n = d.pop_number();
    if (eship_table[n + 500] != null)
      set_value("eship", i, eship_table[n + 500].first_id);
    else
      set_value("eship", i, +(n === 1));
  }
  for (i = 0; i < 6; ++i)
    set_value("efp-input", i, Math.min(d.pop_number(), 999));

  for (i = 0; i < 11; ++i)
    set_checkbox_value("max-prof", i, d.pop_number());

  if (version >= 3) {
    set_checkbox_value("enable-pre-battle", null, d.pop_number());
    for (i = 0; i < 10; ++i) {
      n = d.pop_number();
      set_value("pre-battle", i, [0, 1, 3, 5, 7, 10].indexOf(n) >= 0 ? n : 0);
    }
  }

  set_checkbox_value("enable-pre-lbas", null, d.pop_number());
  for (i = 0; i < 6; ++i) {
    n = d.pop_number();
    set_value("pre-lbas", i, [0, 1, 4, 6, 8, 10].indexOf(n) >= 0 ? n : 0);
  }

  if (d.pop_test())
    throw new Error("load_data_code: code contains too many elements");

  update();
}

/**
 * URLのパラメータを取得する
 * @return {Object} URLパラメータの連想配列
 */
function get_url_params() {
  var search_str = $(location).attr("search");
  if (search_str === "") return {};
  var params = {};
  search_str.slice(1).split("&").forEach(function (s) {
    var p = s.split("=");
    params[p[0]] = p[1];
  });
  return params;
}


/***********************************************************
 *    Base64コード生成・復号器
 ***********************************************************/

/**
 * 0～63までの整数を引数に取り、(URL-safe) Base64の文字に変換する
 * @param {number} num - 0～63までの整数
 * @return {string} Base64に変換された文字
 * @throws {RangeError} 入力が0～63の範囲外の場合
 */
function encode_base64_char(num) {
  if (0 <= num && num < 26)
    return String.fromCharCode("A".charCodeAt() + num);
  if (26 <= num && num < 52)
    return String.fromCharCode("a".charCodeAt() + num - 26);
  if (52 <= num && num < 62)
    return String.fromCharCode("0".charCodeAt() + num - 52);
  if (num === 62)
    return "-";
  if (num === 63)
    return "_";
  throw new RangeError("encode_base64_char: invalid argument: " + num);
}

/**
 * (URL-safe) Base64の文字を1文字引数に取り、数値に変換する
 * @param {string} char - 入力の文字 (1文字)
 * @return {number} 変換後の数値
 * @throws {Error} 入力が (URL-safe) Base64に存在しない文字の場合
 */
function decode_base64_char(char) {
  var char_code = char.charCodeAt();
  var code_A = "A".charCodeAt();
  var code_a = "a".charCodeAt();
  var code_0 = "0".charCodeAt();
  if (code_A <= char_code && char_code < code_A + 26)
    return char_code - code_A;
  if (code_a <= char_code && char_code < code_a + 26)
    return char_code - code_a + 26;
  if (code_0 <= char_code && char_code < code_0 + 10)
    return char_code - code_0 + 52;
  if (char === "-")
    return 62;
  if (char === "_")
    return 63;
  throw new Error("decode_base64_char: invalid argument: " + char);
}

/*
 * コードフォーマット:
 *   - 各文字はBase64でエンコードされた3桁の4進数として解釈する
 *   - リトルエンディアン (?)
 *   - 4進数の0～2を用いて非負整数を3進数で記録する
 *   - 区切り文字として4進数の3を用いる
 */

/**
 * 非負整数のシーケンス -> Base64文字列の生成器を作成する
 * @constructor
 */
function CodeEncoder() {
  this.code = "";
  this.last_code = 0;
  this.shift = 6;
}

/**
 * エンコーダに0～3の整数を追加する (private)
 * @private
 * @param {number} num - 0～3の整数
 * @return {void}
 */
CodeEncoder.prototype._push_number_internal = function (num) {
  this.last_code += num << (this.shift -= 2);
  if (this.shift === 0) {
    this.code += encode_base64_char(this.last_code);
    this.last_code = 0;
    this.shift = 6;
  }
};

/**
 * エンコーダに非負整数を追加する
 * @param {number|string} num - 入力の非負整数
 * @return {void}
 * @throws {Error} 入力が非負整数でない場合
 */
CodeEncoder.prototype.push_number = function (num) {
  var n = +num;
  if (!$.isNumeric(num) || n < 0 || n !== Math.floor(n))
    throw new Error("CodeEncoder: push_number: invalid argument: " + num);
  while (n > 0) {
    this._push_number_internal(n % 3);
    n = Math.floor(n / 3);
  }
  this._push_number_internal(3);
};

/**
 * Base64にエンコードされた文字列を取得する
 * @return {string} Base64にエンコードされた文字列
 */
CodeEncoder.prototype.generate_code = function () {
  return this.code + (this.last_code ? encode_base64_char(this.last_code): "");
};

/**
 * Base64文字列 -> 非負整数のシーケンスの生成器を作成する
 * @param {string} code - デコードする (URL-safe) Base64文字列
 * @constructor
 * @throws {TypeError} 引数が文字列でない場合
 */
function CodeDecoder(code) {
  if (typeof code !== "string")
    throw new TypeError("CodeDecoder: Constructor: invalid argument: " + code);
  this.code = code;
  this.reading_code = 0;
  this.pos = -1;
  this.shift = 0;
}

/**
 * デコーダから0～3の整数を1桁取得する (private)
 * @private
 * @return {number} 0～3の整数、またはこれ以上数値を取得できない場合は-1
 */
CodeDecoder.prototype._pop_number_internal = function () {
  if (this.shift === 0) {
    if (this.pos === this.code.length - 1) return -1;
    this.reading_code = decode_base64_char(this.code[++this.pos]);
    this.shift = 6;
  }
  return (this.reading_code >> (this.shift -= 2)) & 3;
};

/**
 * デコーダから数値を取得する
 * @return {number} 取得した数値
 * @throws {Error} 数値を取得できなかった場合
 */
CodeDecoder.prototype.pop_number = function () {
  var ret = 0, base = 1;
  while (true) {
    var n = this._pop_number_internal();
    if (n === 3) return ret;
    if (n === -1) throw new Error("CodeDecoder: pop_number: reached end of code");
    ret += base * n;
    base *= 3;
  }
};

/**
 * デコーダから数値を取得できるかどうかをテストする
 * @return {boolean} 数値を取得できるかどうか
 */
CodeDecoder.prototype.pop_test = function () {
  return this.pos !== this.code.length - 1 ||
         this.reading_code % (1 << this.shift) !== 0;
};


/***********************************************************
 *    ツールチップ表示
 ***********************************************************/

/**
 * ツールチップを表示する
 * @param {string} target_id - ツールチップを表示させるHTML要素のID
 * @param {string} message - 表示する文字列。HTMLタグが利用可能
 * @param {number=} timeout - ツールチップを timeout [ms] 表示したら消す
 * @param {Function=} callback - ツールチップを消す際に呼ばれる関数
 * @return {void}
 */
function show_tooltip(target_id, message, timeout, callback) {
  var $prev_tooltip = $(".tooltip-content");
  if ($prev_tooltip.length)
    $prev_tooltip.data("complete")();

  var $window = $(window);
  var $target = $("#" + target_id);
  var $tooltip = $("<div>").addClass("tooltip-content");
  var top = false;

  var width = $(".wrapper").width();
  width += +$("body").css("margin-left").slice(0, -2);
  width += +$("body").css("margin-right").slice(0, -2);
  width = Math.max(width, $(window).width());

  $tooltip.css("opacity", 0).html(message).appendTo("body");
  $tooltip.width(Math.min(+$tooltip.width() + 2, 360));

  var pos_left = $target.offset().left + ($target.outerWidth() / 2) - ($tooltip.outerWidth() / 2);
  var pos_top = $target.offset().top - $tooltip.outerHeight() - 20;

  if (pos_left - $window.scrollLeft() < 0) {
    pos_left = $target.offset().left + $target.outerWidth() / 2 - 20;
    $tooltip.addClass("left");
  }

  if (pos_left + $tooltip.outerWidth() - $window.scrollLeft() > width) {
    pos_left = $target.offset().left - $tooltip.outerWidth() + $target.outerWidth() / 2 + 20;
    $tooltip.addClass("right");
  }

  if (pos_top - $window.scrollTop() < 0) {
    top = true;
    pos_top = $target.offset().top + $target.outerHeight() + 20;
    $tooltip.addClass("top");
  }

  $tooltip.css({ left: pos_left, top: pos_top });
  $tooltip.animate({ top: top ? "-=10" : "+=10", opacity: 1 }, 100);

  var removed = false;
  function remove_tooltip() {
    if (removed) return;
    removed = true;
    $tooltip.animate({ top: top ? "+=10" : "-=10", opacity: 0 }, 90, function() { $tooltip.remove(); });
    $target.off("mouseleave.tooltip");
    if (callback != null) callback();
  }

  $target.on("mouseleave.tooltip", remove_tooltip);
  $tooltip.data("complete", remove_tooltip);
  if (timeout != null) setTimeout(remove_tooltip, timeout);
}


/***********************************************************
 *    実行コード
 ***********************************************************/

init();
